[
  {
    "id": "ls-photosynthesis",
    "subject": "Life Science",
    "title": "Photosynthesis",
    "whatIsIt": "Photosynthesis is the process plants use to convert sunlight, water, and carbon dioxide into glucose (sugar) and oxygen. It is the foundation of almost all life on Earth because it produces the food and oxygen that animals need.",
    "howItWorks": "Photosynthesis happens in two main stages inside chloroplasts. In the light-dependent reactions, chlorophyll in the thylakoid membranes captures light energy. This energy splits water molecules, releasing oxygen as a byproduct and producing ATP and NADPH. In the Calvin cycle (light-independent reactions), these energy carriers are used to fix carbon dioxide from the air into organic molecules, eventually building glucose. The overall equation is: 6 CO₂ + 6 H₂O + light → C₆H₁₂O₆ + 6 O₂.",
    "realWorldExample": "When you see a green lawn or a forest, every green part is busy doing photosynthesis. The oxygen you breathe comes mostly from ocean phytoplankton and land plants doing this process.",
    "keyTerms": [
      {"term": "Chlorophyll", "definition": "The green pigment in chloroplasts that captures light energy."},
      {"term": "Chloroplast", "definition": "The organelle where photosynthesis takes place in plant cells."},
      {"term": "Glucose", "definition": "A simple sugar (C₆H₁₂O₆) that is the main product of photosynthesis."},
      {"term": "Stomata", "definition": "Small openings on leaves that let CO₂ in and O₂ out."},
      {"term": "Calvin cycle", "definition": "Light-independent reactions that build glucose from CO₂ using ATP and NADPH."}
    ],
    "nsbTraps": [
      "Students often confuse the reactants and products: CO₂ and water go IN; glucose and oxygen come OUT.",
      "Photosynthesis happens in chloroplasts, not mitochondria (that's cellular respiration)."
    ],
    "didYouKnow": [
      "A single leaf can have about 500,000 chloroplasts per square millimeter.",
      "The oxygen in every other breath you take likely came from the ocean."
    ],
    "relatedTopics": ["ls-cellular-respiration", "ls-cell-organelles", "ls-plant-biology"]
  },
  {
    "id": "ls-cell-organelles",
    "subject": "Life Science",
    "title": "Cell Structure & Organelles",
    "whatIsIt": "Cells are the basic units of life. Plant and animal cells share many organelles, but plant cells have a cell wall and chloroplasts that animal cells do not.",
    "howItWorks": "The nucleus holds DNA and controls the cell. Mitochondria make ATP (energy). Ribosomes build proteins. The endoplasmic reticulum and Golgi apparatus process and ship proteins. Vacuoles store materials; in plants the central vacuole helps maintain shape. Lysosomes break down waste. The cell membrane controls what enters and leaves.",
    "realWorldExample": "Your muscles have lots of mitochondria because they need lots of energy. Plant leaf cells are packed with chloroplasts for photosynthesis.",
    "keyTerms": [
      {"term": "Nucleus", "definition": "Membrane-bound organelle that contains DNA and controls cell activities."},
      {"term": "Mitochondrion", "definition": "Organelle where cellular respiration produces ATP."},
      {"term": "Ribosome", "definition": "Site of protein synthesis; can be free or attached to ER."},
      {"term": "Cell membrane", "definition": "Phospholipid bilayer that controls what enters and exits the cell."},
      {"term": "Chloroplast", "definition": "Organelle in plant cells where photosynthesis occurs."}
    ],
    "nsbTraps": [
      "Plant cells have both a cell wall and a cell membrane; animal cells only have a cell membrane.",
      "Ribosomes are in both prokaryotes and eukaryotes; the nucleus is only in eukaryotes."
    ],
    "didYouKnow": [
      "Mitochondria have their own DNA and may have evolved from free-living bacteria."
    ],
    "relatedTopics": ["ls-photosynthesis", "ls-cellular-respiration", "ls-cell-processes"]
  },
  {
    "id": "ls-cell-processes",
    "subject": "Life Science",
    "title": "Cell Processes",
    "whatIsIt": "Cells constantly move materials in and out. Osmosis, diffusion, and active transport are three key ways substances cross the cell membrane without the cell having to eat or drink in the way we do.",
    "howItWorks": "Diffusion is the movement of particles from an area of higher concentration to lower concentration until equilibrium is reached; it does not require energy. Osmosis is diffusion of water across a membrane. Active transport moves substances against the concentration gradient (from low to high) and requires energy (ATP) and often protein pumps.",
    "realWorldExample": "When you add salt to a cucumber slice, water leaves the cells by osmosis and the slice shrinks. Roots take in minerals by active transport so they can concentrate nutrients from dilute soil water.",
    "keyTerms": [
      {"term": "Diffusion", "definition": "Movement of particles from high to low concentration without energy."},
      {"term": "Osmosis", "definition": "Diffusion of water across a selectively permeable membrane."},
      {"term": "Active transport", "definition": "Movement of substances against the concentration gradient using ATP."},
      {"term": "Concentration gradient", "definition": "Difference in concentration between two areas; diffusion goes down the gradient."},
      {"term": "Selectively permeable", "definition": "A membrane that allows some substances through but not others."}
    ],
    "nsbTraps": [
      "Osmosis is only about water; diffusion can be any particle. Don't say 'osmosis of salt'—salt moves by diffusion.",
      "Active transport requires energy; diffusion and osmosis do not."
    ],
    "didYouKnow": [
      "Your kidneys use osmosis and active transport to filter blood and reabsorb useful molecules.",
      "Plant roots use active transport to pull in nitrate and other ions from soil."
    ],
    "relatedTopics": ["ls-cell-organelles", "ls-cellular-respiration"]
  },
  {
    "id": "ls-cell-division",
    "subject": "Life Science",
    "title": "Cell Division",
    "whatIsIt": "Cells divide to grow, repair tissues, and make reproductive cells. Mitosis produces two identical body cells; meiosis produces four gametes with half the chromosomes.",
    "howItWorks": "The cell cycle has interphase (growth and DNA replication), then mitosis: prophase, metaphase, anaphase, telophase, and cytokinesis (splitting the cytoplasm). Mitosis keeps the same number of chromosomes (e.g., 46 in humans). Meiosis has two divisions: the first halves the chromosome number; the second separates sister chromatids, producing four haploid cells.",
    "realWorldExample": "When you scrape your knee, mitosis in skin cells fills in the wound. Sperm and egg are produced by meiosis so that when they fuse, the baby has the correct number of chromosomes.",
    "keyTerms": [
      {"term": "Mitosis", "definition": "Division that produces two genetically identical daughter cells; used for growth and repair."},
      {"term": "Meiosis", "definition": "Division that produces four gametes with half the chromosomes; used for reproduction."},
      {"term": "Chromosome", "definition": "Condensed DNA and protein; carries genes."},
      {"term": "Cytokinesis", "definition": "Division of the cytoplasm after mitosis or meiosis."},
      {"term": "Haploid", "definition": "Having one set of chromosomes (n); gametes are haploid."},
      {"term": "Diploid", "definition": "Having two sets of chromosomes (2n); body cells are diploid."}
    ],
    "nsbTraps": [
      "Mitosis = identical copies (same chromosome number). Meiosis = gametes (half the chromosomes).",
      "Interphase is when DNA replicates; mitosis doesn't duplicate DNA, it separates already-duplicated chromosomes."
    ],
    "didYouKnow": [
      "Cancer is often a failure of the cell cycle—cells divide when they shouldn't.",
      "Down syndrome results from an extra copy of chromosome 21, a meiosis error."
    ],
    "relatedTopics": ["ls-cell-organelles", "ls-dna-rna", "ls-genetics"]
  },
  {
    "id": "ls-cellular-respiration",
    "subject": "Life Science",
    "title": "Cellular Respiration",
    "whatIsIt": "Cellular respiration is how cells release energy from glucose (and other fuels) to make ATP. It happens in the mitochondria and uses oxygen (aerobic) or, in some cases, proceeds without oxygen (anaerobic).",
    "howItWorks": "Glycolysis in the cytoplasm breaks one glucose into two pyruvate molecules and makes a little ATP. In aerobic respiration, pyruvate enters the mitochondria: the Krebs cycle and electron transport chain use oxygen to make many more ATP. The overall equation is: C₆H₁₂O₆ + 6 O₂ → 6 CO₂ + 6 H₂O + ATP. Anaerobic respiration (e.g., fermentation) does not use oxygen and produces less ATP; in muscles it makes lactate; in yeast it makes ethanol and CO₂.",
    "realWorldExample": "When you run, your muscles need lots of ATP; they do aerobic respiration. If you sprint and run out of breath, they switch to anaerobic and you feel the burn from lactate.",
    "keyTerms": [
      {"term": "ATP", "definition": "Adenosine triphosphate; the main energy currency of the cell."},
      {"term": "Glycolysis", "definition": "First stage of respiration; breaks glucose into pyruvate in the cytoplasm."},
      {"term": "Aerobic", "definition": "Using oxygen; aerobic respiration produces much more ATP than anaerobic."},
      {"term": "Anaerobic", "definition": "Without oxygen; fermentation is a type of anaerobic respiration."},
      {"term": "Mitochondrion", "definition": "Organelle where the Krebs cycle and electron transport chain occur."}
    ],
    "nsbTraps": [
      "Respiration happens in mitochondria (and cytoplasm for glycolysis); photosynthesis happens in chloroplasts. Don't swap them.",
      "We breathe to get oxygen for cellular respiration; we exhale CO₂ produced by respiration."
    ],
    "didYouKnow": [
      "Photosynthesis and respiration are almost opposite reactions: plants do both.",
      "Some bacteria do anaerobic respiration and don't need oxygen at all."
    ],
    "relatedTopics": ["ls-photosynthesis", "ls-cell-organelles"]
  },
  {
    "id": "ls-dna-rna",
    "subject": "Life Science",
    "title": "DNA & RNA",
    "whatIsIt": "DNA stores genetic information; RNA helps use that information to build proteins. DNA is double-stranded and stays in the nucleus; RNA is single-stranded and can leave the nucleus.",
    "howItWorks": "DNA is made of nucleotides (sugar, phosphate, and a base: A, T, G, C). Replication copies DNA before cell division. In transcription, DNA is copied into mRNA in the nucleus. In translation, mRNA is read by ribosomes to build proteins using tRNA and amino acids. The sequence of bases in DNA (genes) codes for the sequence of amino acids in proteins.",
    "realWorldExample": "When you grow, your cells replicate DNA so each new cell has a full set of instructions. When you digest food, enzymes (which are proteins) are made by reading genes through transcription and translation.",
    "keyTerms": [
      {"term": "Replication", "definition": "Process of copying DNA before cell division."},
      {"term": "Transcription", "definition": "Copying DNA into mRNA in the nucleus."},
      {"term": "Translation", "definition": "Reading mRNA on ribosomes to build proteins."},
      {"term": "Gene", "definition": "A segment of DNA that codes for a protein or functional RNA."},
      {"term": "mRNA", "definition": "Messenger RNA; carries the code from DNA to the ribosome."},
      {"term": "Base pairing", "definition": "In DNA, A with T and G with C; in RNA, A with U and G with C."}
    ],
    "nsbTraps": [
      "DNA has T (thymine); RNA has U (uracil). Don't say 'DNA has uracil.'",
      "Transcription makes RNA from DNA; translation makes protein from RNA. Order matters."
    ],
    "didYouKnow": [
      "If you stretched out all the DNA in one cell, it would be about 2 meters long.",
      "The same genetic code is used by almost all living things—evidence for common ancestry."
    ],
    "relatedTopics": ["ls-cell-division", "ls-genetics", "ls-mutations"]
  },
  {
    "id": "ls-genetics",
    "subject": "Life Science",
    "title": "Genetics & Heredity",
    "whatIsIt": "Genetics is the study of how traits are passed from parents to offspring. Genes come in versions called alleles; dominant alleles can mask recessive ones.",
    "howItWorks": "Offspring get one allele from each parent. In Mendelian genetics, dominant (capital letter) masks recessive (lowercase). A Punnett square shows possible offspring genotypes. Homozygous means two same alleles (AA or aa); heterozygous means two different (Aa). Phenotype is what you see; genotype is the genetic makeup.",
    "realWorldExample": "If both parents are heterozygous for brown eyes (Bb), there's a 1 in 4 chance of a blue-eyed (bb) child. Pea plants helped Mendel discover these rules.",
    "keyTerms": [
      {"term": "Allele", "definition": "One version of a gene; e.g., allele for brown eyes vs. blue eyes."},
      {"term": "Dominant", "definition": "An allele that shows its trait even when only one copy is present."},
      {"term": "Recessive", "definition": "An allele that only shows when two copies are present."},
      {"term": "Punnett square", "definition": "A diagram used to predict the genotypes of offspring."},
      {"term": "Genotype", "definition": "The genetic makeup (e.g., AA, Aa, aa)."},
      {"term": "Phenotype", "definition": "The observable trait (e.g., brown eyes, tall)."}
    ],
    "nsbTraps": [
      "Dominant does not mean 'most common'—recessive traits can be common in a population.",
      "Two heterozygous parents can have homozygous recessive offspring (25% chance for one gene)."
    ],
    "didYouKnow": [
      "Mendel worked with pea plants in the 1800s; his work was rediscovered decades later.",
      "Many traits are controlled by multiple genes, not just one."
    ],
    "relatedTopics": ["ls-dna-rna", "ls-mutations", "ls-cell-division"]
  },
  {
    "id": "ls-mutations",
    "subject": "Life Science",
    "title": "Mutations & Genetic Variation",
    "whatIsIt": "A mutation is a change in the DNA sequence. Mutations can be harmful, helpful, or have no effect. They are the raw material for evolution.",
    "howItWorks": "Mutations can happen from copying errors during replication, UV light, chemicals, or other factors. Point mutations change one or a few bases; frameshift mutations (insertion or deletion) shift how the code is read. Some mutations affect a single gene; others change chromosome number or structure. Only mutations in gametes (egg or sperm) are passed to offspring.",
    "realWorldExample": "Sickle cell anemia is caused by a point mutation in the hemoglobin gene. Some people have a mutation that makes them unable to taste bitter compounds.",
    "keyTerms": [
      {"term": "Mutation", "definition": "A change in the DNA sequence."},
      {"term": "Point mutation", "definition": "Change in a single nucleotide (base)."},
      {"term": "Frameshift", "definition": "Insertion or deletion that shifts how codons are read; often serious."},
      {"term": "Genetic variation", "definition": "Differences in DNA among individuals in a population."},
      {"term": "Mutagen", "definition": "Something that causes mutations (e.g., UV radiation, some chemicals)."}
    ],
    "nsbTraps": [
      "Not all mutations cause disease—many have no effect or are beneficial.",
      "Only mutations in reproductive cells are inherited; body cell mutations are not passed on."
    ],
    "didYouKnow": [
      "Mutations created the variety of dog breeds from a common ancestor.",
      "Some mutations can be repaired by the cell's own enzymes."
    ],
    "relatedTopics": ["ls-dna-rna", "ls-genetics", "ls-evolution"]
  },
  {
    "id": "ls-evolution",
    "subject": "Life Science",
    "title": "Evolution & Natural Selection",
    "whatIsIt": "Evolution is the change in heritable traits in a population over time. Natural selection is the main mechanism: organisms with traits better suited to the environment tend to survive and reproduce more.",
    "howItWorks": "There is variation in populations (from mutations and sexual reproduction). Some individuals are better adapted; they survive and pass their genes to the next generation. Over many generations, the population's traits shift. Adaptation is a trait that improves survival or reproduction. Speciation can occur when populations become isolated and diverge enough to become different species.",
    "realWorldExample": "Peppered moths in England became darker when pollution darkened tree bark—birds ate the light ones. Antibiotic-resistant bacteria evolve because the ones that survive treatment reproduce.",
    "keyTerms": [
      {"term": "Natural selection", "definition": "Process by which better-adapted individuals survive and reproduce more."},
      {"term": "Adaptation", "definition": "A trait that helps an organism survive and reproduce in its environment."},
      {"term": "Species", "definition": "A group of organisms that can interbreed and produce fertile offspring."},
      {"term": "Speciation", "definition": "Formation of a new species, often after geographic or reproductive isolation."},
      {"term": "Fitness", "definition": "In evolution, how well an organism survives and reproduces in its environment."}
    ],
    "nsbTraps": [
      "Individuals don't evolve—populations do. A single organism doesn't 'adapt' in the evolutionary sense during its life.",
      "Natural selection doesn't aim for 'perfection'—it favors what works in the current environment."
    ],
    "didYouKnow": [
      "Darwin and Wallace both proposed natural selection; Darwin's On the Origin of Species is famous.",
      "Evolution is supported by fossils, comparative anatomy, DNA, and observed changes in populations."
    ],
    "relatedTopics": ["ls-mutations", "ls-classification", "ls-ecology"]
  },
  {
    "id": "ls-classification",
    "subject": "Life Science",
    "title": "Classification of Life",
    "whatIsIt": "Scientists classify living things into a hierarchy: domain, kingdom, phylum, class, order, family, genus, species. Binomial nomenclature gives each species a two-part Latin name (genus + species).",
    "howItWorks": "The three domains are Bacteria, Archaea, and Eukarya. Eukarya includes kingdoms such as Protista, Fungi, Plantae, and Animalia. Closer groups share more recent common ancestors. Scientific names are italicized; the genus is capitalized (e.g., Homo sapiens).",
    "realWorldExample": "Lions (Panthera leo) and tigers (Panthera tigris) share the same genus, so they're closely related. You're Homo sapiens—genus Homo, species sapiens.",
    "keyTerms": [
      {"term": "Taxonomy", "definition": "The science of naming and classifying organisms."},
      {"term": "Binomial nomenclature", "definition": "Two-part scientific name: genus and species (e.g., Felis catus)."},
      {"term": "Domain", "definition": "The broadest category; Bacteria, Archaea, Eukarya."},
      {"term": "Kingdom", "definition": "Major group within a domain (e.g., Animalia, Plantae)."},
      {"term": "Species", "definition": "Most specific level; organisms that can interbreed and produce fertile offspring."}
    ],
    "nsbTraps": [
      "Kingdom and domain are not the same—there are multiple kingdoms within Eukarya.",
      "Common names vary by language; scientific names are the same worldwide."
    ],
    "didYouKnow": [
      "Linnaeus developed the system we still use today in the 1700s.",
      "DNA evidence has changed how we group some organisms (e.g., reclassifying some protists)."
    ],
    "relatedTopics": ["ls-evolution", "ls-bacteria-viruses", "ls-fungi-protists"]
  },
  {
    "id": "ls-bacteria-viruses",
    "subject": "Life Science",
    "title": "Bacteria & Viruses",
    "whatIsIt": "Bacteria are single-celled prokaryotes (no nucleus); they live everywhere and many are harmless or helpful. Viruses are not cells—they're particles that need a host to reproduce and can cause disease.",
    "howItWorks": "Bacteria have a cell wall, cell membrane, cytoplasm, and DNA in a nucleoid (no nuclear envelope). They reproduce by binary fission. Viruses have genetic material (DNA or RNA) in a protein coat; they attach to host cells, inject their genes, and hijack the cell to make more viruses. Antibiotics kill bacteria but don't work on viruses.",
    "realWorldExample": "Yogurt and cheese are made by bacteria. The flu and COVID-19 are caused by viruses. Your gut has trillions of bacteria that help digestion.",
    "keyTerms": [
      {"term": "Prokaryote", "definition": "Organism whose cells lack a nucleus; bacteria and archaea."},
      {"term": "Binary fission", "definition": "Asexual reproduction in bacteria; one cell splits into two."},
      {"term": "Virus", "definition": "Non-living particle that needs a host cell to replicate."},
      {"term": "Host", "definition": "Organism or cell that a virus or parasite uses to reproduce."},
      {"term": "Antibiotic", "definition": "Medicine that kills or stops bacteria; not effective against viruses."}
    ],
    "nsbTraps": [
      "Viruses are not alive—they don't grow, eat, or reproduce on their own. Bacteria are alive.",
      "Not all bacteria are bad; many are essential. Not all viruses cause disease in humans."
    ],
    "didYouKnow": [
      "There are more bacterial cells in your body than human cells.",
      "Some viruses insert their DNA into the host's genome and stay for a long time."
    ],
    "relatedTopics": ["ls-cell-organelles", "ls-classification", "ls-immune"]
  },
  {
    "id": "ls-fungi-protists",
    "subject": "Life Science",
    "title": "Fungi & Protists",
    "whatIsIt": "Fungi are eukaryotes that absorb nutrients from their environment (decomposers, parasites, or mutualists); they include mushrooms, yeast, and mold. Protists are a diverse group of mostly single-celled eukaryotes that don't fit neatly into plants, animals, or fungi.",
    "howItWorks": "Fungi have cell walls (often of chitin), grow as hyphae that form mycelium, and reproduce with spores. Yeast is single-celled and does fermentation. Protists include algae (plant-like), amoebas (animal-like), and slime molds; some cause disease (e.g., malaria from Plasmodium).",
    "realWorldExample": "Bread rises because yeast ferments and releases CO₂. Pond scum and seaweed are protists. Athlete's foot is caused by a fungus.",
    "keyTerms": [
      {"term": "Fungus", "definition": "Eukaryote that absorbs nutrients; has cell walls of chitin."},
      {"term": "Hypha", "definition": "Thread-like filament that makes up the body of many fungi."},
      {"term": "Spore", "definition": "Reproductive cell that can develop into a new organism without fertilization."},
      {"term": "Protist", "definition": "Diverse eukaryotes that are not plants, animals, or fungi."},
      {"term": "Decomposer", "definition": "Organism that breaks down dead matter and returns nutrients to the ecosystem."}
    ],
    "nsbTraps": [
      "Fungi are not plants—they don't do photosynthesis and have chitin in their cell walls.",
      "Protist is a catch-all group; some protists are more closely related to plants or animals than to other protists."
    ],
    "didYouKnow": [
      "The largest organism on Earth may be a fungus—a honey mushroom in Oregon spanning miles.",
      "Plasmodium, which causes malaria, is a protist spread by mosquitoes."
    ],
    "relatedTopics": ["ls-classification", "ls-ecology", "ls-bacteria-viruses"]
  },
  {
    "id": "ls-plant-biology",
    "subject": "Life Science",
    "title": "Plant Biology",
    "whatIsIt": "Plants have roots, stems, and leaves; vascular tissue (xylem and phloem) moves water and sugars. They make their own food by photosynthesis and reproduce with spores or seeds.",
    "howItWorks": "Roots absorb water and minerals and anchor the plant. Xylem carries water and minerals upward; phloem carries sugars (from photosynthesis) where they're needed. Leaves have stomata for gas exchange. Plants reproduce sexually (flowers, pollination, seeds) or asexually (runners, cuttings). Gymnosperms have naked seeds (e.g., conifers); angiosperms have flowers and enclosed seeds.",
    "realWorldExample": "When you water a plant, roots take in water and xylem moves it to the leaves. Bees pollinate flowers so seeds can form. Maple syrup comes from phloem sap.",
    "keyTerms": [
      {"term": "Xylem", "definition": "Vascular tissue that carries water and minerals from roots upward."},
      {"term": "Phloem", "definition": "Vascular tissue that carries sugars and other nutrients throughout the plant."},
      {"term": "Stomata", "definition": "Openings in leaves (and stems) for gas exchange; allow CO₂ in and O₂ out."},
      {"term": "Pollination", "definition": "Transfer of pollen to the female part of a flower for fertilization."},
      {"term": "Angiosperm", "definition": "Flowering plant; seeds enclosed in fruit."},
      {"term": "Gymnosperm", "definition": "Seed plant with naked seeds (e.g., conifers); no flowers."}
    ],
    "nsbTraps": [
      "Xylem goes up (water and minerals); phloem can go up or down (sugars to where they're needed).",
      "Plants don't 'breathe' like us—they take in CO₂ and release O₂ through stomata for photosynthesis."
    ],
    "didYouKnow": [
      "Some of the oldest living organisms are plants—e.g., bristlecone pines over 5,000 years old.",
      "Venus flytraps and pitcher plants get extra nutrients by digesting insects."
    ],
    "relatedTopics": ["ls-photosynthesis", "ls-cell-organelles", "ls-ecology"]
  },
  {
    "id": "ls-circulatory",
    "subject": "Life Science",
    "title": "Animal Systems: Circulatory System",
    "whatIsIt": "The circulatory system moves blood around the body, delivering oxygen and nutrients and carrying away waste and CO₂. The heart pumps blood through arteries, capillaries, and veins.",
    "howItWorks": "The heart has four chambers: two atria (receive blood) and two ventricles (pump blood). Blood flows: body → veins → right atrium → right ventricle → lungs (pick up O₂, drop CO₂) → left atrium → left ventricle → arteries → body. Red blood cells carry oxygen using hemoglobin; plasma carries nutrients, hormones, and waste. Arteries carry blood away from the heart; veins carry it back.",
    "realWorldExample": "When you run, your heart beats faster to deliver more oxygen to your muscles. A cut bleeds because capillaries are damaged.",
    "keyTerms": [
      {"term": "Artery", "definition": "Blood vessel that carries blood away from the heart; usually oxygen-rich (except pulmonary artery)."},
      {"term": "Vein", "definition": "Blood vessel that carries blood toward the heart; usually oxygen-poor (except pulmonary vein)."},
      {"term": "Capillary", "definition": "Tiny vessel where exchange of gases and nutrients with tissues occurs."},
      {"term": "Hemoglobin", "definition": "Protein in red blood cells that carries oxygen."},
      {"term": "Atrium", "definition": "Upper chamber of the heart that receives blood."},
      {"term": "Ventricle", "definition": "Lower chamber that pumps blood out of the heart."}
    ],
    "nsbTraps": [
      "Arteries don't always carry oxygenated blood—the pulmonary artery carries blood to the lungs to get oxygen.",
      "Blood in veins is not always blue; it's dark red. Veins look blue through skin due to how light is absorbed."
    ],
    "didYouKnow": [
      "Your heart beats about 100,000 times per day.",
      "Earthworms have a closed circulatory system; insects have an open one with hemolymph."
    ],
    "relatedTopics": ["ls-respiratory", "ls-digestive", "ls-immune"]
  },
  {
    "id": "ls-respiratory",
    "subject": "Life Science",
    "title": "Animal Systems: Respiratory System",
    "whatIsIt": "The respiratory system brings oxygen into the body and removes carbon dioxide. In humans, air enters through the nose or mouth, passes through the trachea, bronchi, and bronchioles, and reaches the alveoli where gas exchange happens.",
    "howItWorks": "When you inhale, the diaphragm and rib muscles contract, expanding the chest so air flows in. In the alveoli (tiny air sacs), oxygen diffuses into the blood and CO₂ diffuses out. When you exhale, the diaphragm relaxes and air is pushed out. Breathing is controlled by the brain in response to CO₂ levels in the blood.",
    "realWorldExample": "When you hold your breath, CO₂ builds up and eventually your brain forces you to breathe. At high altitude there's less oxygen, so you breathe faster.",
    "keyTerms": [
      {"term": "Trachea", "definition": "Windpipe; carries air from throat to bronchi."},
      {"term": "Alveolus", "definition": "Tiny air sac in the lung where gas exchange with blood occurs."},
      {"term": "Diaphragm", "definition": "Muscle below the lungs that contracts to pull air in and relaxes to push air out."},
      {"term": "Bronchus", "definition": "One of the two main tubes that branch from the trachea into the lungs."},
      {"term": "Gas exchange", "definition": "Diffusion of O₂ into blood and CO₂ out of blood in the alveoli."}
    ],
    "nsbTraps": [
      "We breathe to get oxygen for cellular respiration, but the trigger to breathe is usually rising CO₂, not low oxygen.",
      "Air goes to alveoli; blood goes to alveoli in capillaries—they're the site of exchange, not the mouth."
    ],
    "didYouKnow": [
      "You have about 300 million alveoli in your lungs—huge surface area for gas exchange.",
      "Fish use gills for gas exchange; water flows over gill filaments where O₂ diffuses in."
    ],
    "relatedTopics": ["ls-circulatory", "ls-cellular-respiration"]
  },
  {
    "id": "ls-digestive",
    "subject": "Life Science",
    "title": "Animal Systems: Digestive System",
    "whatIsIt": "The digestive system breaks down food into nutrients the body can absorb and use. It includes the mouth, esophagus, stomach, small intestine, large intestine, and accessory organs like the liver and pancreas.",
    "howItWorks": "Mechanical digestion (chewing, stomach churning) and chemical digestion (enzymes and acid) break food into small molecules. In the small intestine, nutrients are absorbed into the blood. The large intestine absorbs water and forms feces. The liver makes bile (stored in gallbladder) to help digest fats; the pancreas releases enzymes and bicarbonate.",
    "realWorldExample": "When you eat a sandwich, amylase in saliva starts breaking down starch. Protein is digested in the stomach and small intestine. Fiber isn't digested but helps move material through the large intestine.",
    "keyTerms": [
      {"term": "Enzyme", "definition": "Protein that speeds up chemical reactions; digestive enzymes break down food molecules."},
      {"term": "Small intestine", "definition": "Where most digestion and absorption of nutrients occurs; has villi to increase surface area."},
      {"term": "Villi", "definition": "Finger-like projections in the small intestine that increase surface area for absorption."},
      {"term": "Liver", "definition": "Makes bile, processes nutrients, detoxifies; bile helps digest fats."},
      {"term": "Peristalsis", "definition": "Wave-like muscle contractions that move food through the digestive tract."}
    ],
    "nsbTraps": [
      "Absorption of nutrients happens mainly in the small intestine, not the stomach.",
      "The stomach absorbs very little—mostly alcohol and some water. Don't say 'stomach absorbs nutrients.'"
    ],
    "didYouKnow": [
      "The small intestine is about 6 meters long; its villi give it the surface area of a tennis court.",
      "Stomach acid is strong enough to kill many bacteria in food."
    ],
    "relatedTopics": ["ls-circulatory", "ls-cellular-respiration", "ls-nervous"]
  },
  {
    "id": "ls-nervous",
    "subject": "Life Science",
    "title": "Animal Systems: Nervous System & Brain",
    "whatIsIt": "The nervous system receives information from the environment and body, processes it, and coordinates responses. The brain and spinal cord make up the central nervous system (CNS); nerves make up the peripheral nervous system (PNS).",
    "howItWorks": "Neurons (nerve cells) carry electrical signals. Sensory neurons bring information from sense organs to the CNS; motor neurons carry commands from the CNS to muscles and glands. At synapses, chemicals (neurotransmitters) pass the signal to the next cell. The brain has regions for different functions: cerebrum (thinking, voluntary movement), cerebellum (balance, coordination), brainstem (breathing, heart rate).",
    "realWorldExample": "When you touch something hot, sensory neurons send 'hot!' to your spinal cord and brain; motor neurons tell your hand to pull away in a reflex. Learning and memory involve changes at synapses.",
    "keyTerms": [
      {"term": "Neuron", "definition": "Nerve cell that carries electrical impulses."},
      {"term": "Synapse", "definition": "Junction where a neuron passes a signal to another cell using neurotransmitters."},
      {"term": "Central nervous system (CNS)", "definition": "Brain and spinal cord."},
      {"term": "Peripheral nervous system (PNS)", "definition": "Nerves that connect the CNS to the rest of the body."},
      {"term": "Reflex", "definition": "Rapid, automatic response that can involve the spinal cord without the brain."},
      {"term": "Cerebrum", "definition": "Largest part of the brain; involved in thinking, memory, and voluntary movement."}
    ],
    "nsbTraps": [
      "Reflexes can happen without the brain (spinal reflex)—so 'reflex' doesn't always mean the brain decided.",
      "Neurons don't touch—there's a gap (synapse) where neurotransmitters cross."
    ],
    "didYouKnow": [
      "The human brain has about 86 billion neurons.",
      "The left side of the brain often controls the right side of the body, and vice versa."
    ],
    "relatedTopics": ["ls-endocrine", "ls-digestive", "ls-skeletal-muscular"]
  },
  {
    "id": "ls-endocrine",
    "subject": "Life Science",
    "title": "Animal Systems: Endocrine System",
    "whatIsIt": "The endocrine system uses hormones—chemical signals released into the blood—to regulate growth, metabolism, mood, and many other processes. Glands make and release hormones; target cells have receptors that respond.",
    "howItWorks": "The pituitary gland (in the brain) is often called the 'master gland' because it controls other glands. The thyroid regulates metabolism; the adrenal glands help with stress and blood pressure; the pancreas releases insulin and glucagon to control blood sugar. Hormones work slowly and their effects can last a long time. Negative feedback keeps hormone levels in balance.",
    "realWorldExample": "When blood sugar rises after a meal, the pancreas releases insulin so cells take up glucose. Growth hormone from the pituitary helps you grow during puberty.",
    "keyTerms": [
      {"term": "Hormone", "definition": "Chemical messenger released by glands into the blood; affects target cells."},
      {"term": "Gland", "definition": "Organ or group of cells that makes and releases hormones or other substances."},
      {"term": "Pituitary", "definition": "Small gland in the brain that controls many other endocrine glands."},
      {"term": "Insulin", "definition": "Hormone from the pancreas that lowers blood sugar by helping cells take in glucose."},
      {"term": "Negative feedback", "definition": "When a response reduces the stimulus (e.g., insulin lowers sugar; when sugar is low, less insulin is released)."}
    ],
    "nsbTraps": [
      "Hormones travel in blood; neurotransmitters work across synapses. Don't confuse the two.",
      "The pancreas is both an exocrine gland (digestive enzymes) and endocrine (insulin, glucagon)."
    ],
    "didYouKnow": [
      "Diabetes occurs when the body doesn't make enough insulin or doesn't respond to it.",
      "The adrenal gland releases adrenaline (epinephrine) in 'fight or flight' situations."
    ],
    "relatedTopics": ["ls-nervous", "ls-digestive", "ls-reproductive"]
  },
  {
    "id": "ls-immune",
    "subject": "Life Science",
    "title": "Animal Systems: Immune System",
    "whatIsIt": "The immune system defends the body against pathogens (bacteria, viruses, and other invaders). It has nonspecific defenses (barriers, inflammation) and specific defenses (antibodies and immune cells that recognize particular pathogens).",
    "howItWorks": "Skin and mucous membranes are first-line barriers. If a pathogen gets in, white blood cells attack: some engulf invaders (phagocytes), others make antibodies that bind to specific antigens. Vaccines train the immune system to recognize a pathogen without getting sick. Memory cells 'remember' past infections for a faster response next time. Allergies are an overreaction to harmless substances.",
    "realWorldExample": "When you get a cut, the area may swell and turn red—that's inflammation bringing immune cells to fight germs. After recovering from chickenpox, you usually don't get it again because of immune memory.",
    "keyTerms": [
      {"term": "Pathogen", "definition": "Disease-causing organism or virus."},
      {"term": "Antibody", "definition": "Protein made by immune cells that binds to a specific antigen and helps destroy the pathogen."},
      {"term": "Antigen", "definition": "Molecule on a pathogen (or other substance) that the immune system recognizes."},
      {"term": "Vaccine", "definition": "Preparation that trains the immune system to recognize a pathogen without causing disease."},
      {"term": "White blood cell", "definition": "Cell that fights infection; includes phagocytes and lymphocytes."}
    ],
    "nsbTraps": [
      "Antibiotics kill bacteria, not viruses. Antibodies are made by your body; antibiotics are medicines.",
      "Vaccines don't give you the disease—they use weakened or dead pathogens or pieces of them to trigger immunity."
    ],
    "didYouKnow": [
      "You have more bacterial cells in your body than human cells, but most don't make you sick.",
      "Some white blood cells can 'remember' a pathogen for decades."
    ],
    "relatedTopics": ["ls-bacteria-viruses", "ls-circulatory"]
  },
  {
    "id": "ls-skeletal-muscular",
    "subject": "Life Science",
    "title": "Animal Systems: Skeletal & Muscular Systems",
    "whatIsIt": "The skeleton provides support, protects organs, and (with muscles) allows movement. Bones store minerals and make blood cells. Muscles contract to pull on bones; they work in pairs (e.g., bicep and tricep) to move joints.",
    "howItWorks": "Bones are connected by ligaments; muscles are attached to bones by tendons. Skeletal muscle is voluntary and striated; smooth muscle (e.g., in the digestive tract) and cardiac muscle (heart) are involuntary. When a muscle contracts, it shortens and pulls the bone. Muscles need ATP from cellular respiration; they also need oxygen, which is why you breathe hard when you exercise.",
    "realWorldExample": "When you bend your arm, the bicep contracts and the tricep relaxes. To straighten your arm, the tricep contracts and the bicep relaxes. Broken bones can heal because bone cells make new matrix.",
    "keyTerms": [
      {"term": "Ligament", "definition": "Connective tissue that connects bone to bone at a joint."},
      {"term": "Tendon", "definition": "Connective tissue that connects muscle to bone."},
      {"term": "Voluntary muscle", "definition": "Muscle you can control (e.g., skeletal muscle)."},
      {"term": "Involuntary muscle", "definition": "Muscle you don't consciously control (e.g., heart, digestive tract)."},
      {"term": "Joint", "definition": "Where two bones meet; can be movable (knee) or not (skull sutures)."}
    ],
    "nsbTraps": [
      "Muscles only pull; they don't push. So you need paired muscles for two-way movement.",
      "Bones are living tissue—they have cells, blood vessels, and can repair themselves."
    ],
    "didYouKnow": [
      "You have more than 200 bones at birth; some fuse so adults have about 206.",
      "The strongest muscle by weight is the masseter (jaw); the largest is the gluteus maximus."
    ],
    "relatedTopics": ["ls-nervous", "ls-circulatory", "ls-digestive"]
  },
  {
    "id": "ls-reproductive",
    "subject": "Life Science",
    "title": "Animal Systems: Reproductive System",
    "whatIsIt": "The reproductive system produces gametes (sperm and egg) and, in many animals, supports fertilization and development of offspring. In humans, male reproductive organs produce sperm; female organs produce eggs and support pregnancy.",
    "howItWorks": "Meiosis produces haploid gametes. In fertilization, sperm and egg fuse to form a zygote with the full set of chromosomes. The zygote divides by mitosis and develops into an embryo, then a fetus. Reproductive hormones (e.g., from the pituitary and gonads) control the development of gametes and secondary sex characteristics. Different organisms reproduce in different ways: internal or external fertilization; live birth or eggs.",
    "realWorldExample": "In humans, one egg is usually released per month from the ovaries. Sperm are produced continuously in the testes. When a sperm fertilizes an egg, development begins.",
    "keyTerms": [
      {"term": "Gamete", "definition": "Reproductive cell (sperm or egg) with half the normal chromosomes."},
      {"term": "Fertilization", "definition": "Fusion of sperm and egg to form a zygote."},
      {"term": "Zygote", "definition": "Fertilized egg; first cell of a new individual."},
      {"term": "Meiosis", "definition": "Cell division that produces gametes with half the chromosome number."},
      {"term": "Ovary", "definition": "Female organ that produces eggs (and hormones)."},
      {"term": "Testis", "definition": "Male organ that produces sperm (and hormones)."}
    ],
    "nsbTraps": [
      "Gametes are haploid; the zygote is diploid. Don't say the egg or sperm is diploid.",
      "Not all reproduction is sexual—many organisms can reproduce asexually (e.g., budding, cloning)."
    ],
    "didYouKnow": [
      "Identical twins come from one zygote that splits; fraternal twins come from two fertilized eggs.",
      "Some animals can change sex or reproduce without a partner (asexually)."
    ],
    "relatedTopics": ["ls-cell-division", "ls-genetics", "ls-endocrine"]
  },
  {
    "id": "ls-ecology",
    "subject": "Life Science",
    "title": "Ecology & Ecosystems",
    "whatIsIt": "Ecology is the study of how organisms interact with each other and their environment. An ecosystem includes all the living (biotic) and nonliving (abiotic) things in an area and the energy and nutrients flowing through them.",
    "howItWorks": "Producers (plants, algae) capture energy from the sun and make organic matter. Consumers eat producers or other consumers. Decomposers break down dead matter and return nutrients to the soil. Food chains show one path of energy; food webs show many interconnected chains. Energy is lost at each trophic level (only about 10% passes up); nutrients cycle (carbon, nitrogen, water cycles).",
    "realWorldExample": "In a pond, algae are producers; small fish eat algae; big fish eat small fish. When any of them die, bacteria and fungi decompose them. The same nutrients are used again.",
    "keyTerms": [
      {"term": "Producer", "definition": "Organism that makes its own food (usually by photosynthesis); base of the food chain."},
      {"term": "Consumer", "definition": "Organism that eats other organisms for energy."},
      {"term": "Decomposer", "definition": "Organism that breaks down dead matter and recycles nutrients."},
      {"term": "Food chain", "definition": "Path of energy from producer to consumer to higher consumers."},
      {"term": "Trophic level", "definition": "Position in a food chain (e.g., producer, primary consumer, secondary consumer)."},
      {"term": "Ecosystem", "definition": "All living and nonliving things in an area and their interactions."}
    ],
    "nsbTraps": [
      "Energy flows one way (sun → producers → consumers); nutrients cycle (decomposers return them).",
      "Top predators have less total energy available—that's why there are fewer of them."
    ],
    "didYouKnow": [
      "A single food web can have hundreds of species. Removing one can affect many others.",
      "The energy in your food originally came from the sun, captured by plants or algae."
    ],
    "relatedTopics": ["ls-photosynthesis", "ls-biomes", "ls-symbiosis", "ls-biodiversity"]
  },
  {
    "id": "ls-biomes",
    "subject": "Life Science",
    "title": "Biomes",
    "whatIsIt": "Biomes are large regions with similar climate, plants, and animals. Examples include tundra, taiga, temperate forest, tropical rainforest, grassland, desert, and aquatic biomes (freshwater and marine).",
    "howItWorks": "Climate (temperature and precipitation) mainly determines biomes. Latitude, elevation, and geography also matter. Each biome has characteristic plants and animals adapted to that climate. Tropical rainforests have high rain and biodiversity; deserts have little rain and organisms adapted to save water; tundra is cold with permafrost and short growing seasons.",
    "realWorldExample": "Cacti are adapted to deserts (store water, spines reduce water loss). Polar bears are adapted to the Arctic (thick fur, fat). You wouldn't find a cactus in the tundra or a polar bear in the Sahara.",
    "keyTerms": [
      {"term": "Biome", "definition": "Large region with similar climate and characteristic communities of plants and animals."},
      {"term": "Tundra", "definition": "Cold biome with permafrost, short summers, and low diversity."},
      {"term": "Rainforest", "definition": "Biome with high rainfall and very high biodiversity (tropical or temperate)."},
      {"term": "Desert", "definition": "Biome with very low precipitation; organisms are adapted to conserve water."},
      {"term": "Adaptation", "definition": "Trait that helps an organism survive in its environment."}
    ],
    "nsbTraps": [
      "Biome is not the same as ecosystem—biome is broader (e.g., 'tropical rainforest' is a biome; one patch of it is an ecosystem).",
      "Aquatic biomes (ocean, lake, wetland) are also biomes—not just land."
    ],
    "didYouKnow": [
      "The Amazon rainforest produces a large amount of the world's oxygen and holds huge biodiversity.",
      "Permafrost in the tundra stores a lot of carbon; if it thaws, it could affect global climate."
    ],
    "relatedTopics": ["ls-ecology", "ls-evolution", "ls-biodiversity"]
  },
  {
    "id": "ls-population-ecology",
    "subject": "Life Science",
    "title": "Population Ecology",
    "whatIsIt": "Population ecology studies how populations (groups of the same species in an area) change over time—births, deaths, immigration, emigration—and what limits their size, such as carrying capacity and interactions with other species.",
    "howItWorks": "Population growth depends on birth rate, death rate, and movement in or out. In ideal conditions, populations can grow exponentially. In nature, limiting factors (food, space, disease, predators) slow growth; the population may level off at the carrying capacity (the max the environment can support). Predator-prey cycles can cause populations to rise and fall in patterns. Competition (within or between species) also limits population size.",
    "realWorldExample": "When deer have plenty of food and few predators, their population can explode. When wolves were reintroduced to Yellowstone, elk behavior and plant growth changed—showing how predators affect whole ecosystems.",
    "keyTerms": [
      {"term": "Carrying capacity", "definition": "Maximum population size an environment can support over time."},
      {"term": "Limiting factor", "definition": "Something that limits population growth (e.g., food, space, predators)."},
      {"term": "Predator-prey cycle", "definition": "Pattern where predator and prey populations rise and fall in relation to each other."},
      {"term": "Exponential growth", "definition": "Growth at a constant rate; population size increases faster and faster until limited."},
      {"term": "Competition", "definition": "When organisms need the same limited resource; can be within or between species."}
    ],
    "nsbTraps": [
      "Carrying capacity is not the same as 'maximum possible'—it's what the environment can sustain long-term.",
      "Predator and prey populations are linked; when prey drop, predators may drop too, then prey can recover."
    ],
    "didYouKnow": [
      "Human population growth has been exponential for the last few centuries; we're now over 8 billion.",
      "In a classic experiment, predator and prey (e.g., lynx and hare) show clear cycles in population graphs."
    ],
    "relatedTopics": ["ls-ecology", "ls-symbiosis", "ls-biodiversity"]
  },
  {
    "id": "ls-symbiosis",
    "subject": "Life Science",
    "title": "Symbiosis",
    "whatIsIt": "Symbiosis is a close, long-term relationship between two different species. The main types are mutualism (both benefit), commensalism (one benefits, the other is unaffected), and parasitism (one benefits, the other is harmed).",
    "howItWorks": "In mutualism, both species gain—e.g., bees get nectar and flowers get pollinated. In commensalism, one benefits and the other isn't helped or hurt—e.g., a bird nesting in a tree. In parasitism, the parasite benefits (gets food or shelter) and the host is harmed—e.g., tapeworms in intestines, ticks on mammals. Symbiosis can shape evolution and ecosystem structure.",
    "realWorldExample": "Lichens are mutualism between a fungus and an alga. Remora fish attach to sharks for rides (commensalism). Fleas on a dog are parasites.",
    "keyTerms": [
      {"term": "Mutualism", "definition": "Symbiosis where both species benefit."},
      {"term": "Commensalism", "definition": "Symbiosis where one benefits and the other is unaffected."},
      {"term": "Parasitism", "definition": "Symbiosis where one benefits (parasite) and the other is harmed (host)."},
      {"term": "Host", "definition": "Organism that a parasite lives on or in and gets resources from."},
      {"term": "Parasite", "definition": "Organism that lives on or in another and harms it while benefiting."}
    ],
    "nsbTraps": [
      "Commensalism is 'one benefits, one unaffected'—not 'one benefits, one is hurt' (that's parasitism).",
      "Predation is not usually called symbiosis—symbiosis implies a close, ongoing relationship."
    ],
    "didYouKnow": [
      "Your gut bacteria are mutualists—you give them a home and food; they help you digest and make some vitamins.",
      "Some ants 'farm' aphids and protect them in return for sugary honeydew—a kind of mutualism."
    ],
    "relatedTopics": ["ls-ecology", "ls-evolution", "ls-biodiversity"]
  },
  {
    "id": "ls-biodiversity",
    "subject": "Life Science",
    "title": "Biodiversity & Conservation",
    "whatIsIt": "Biodiversity is the variety of life—different species, genetic diversity within species, and variety of ecosystems. Conservation is the effort to protect and preserve biodiversity and ecosystems for the future.",
    "howItWorks": "Biodiversity is important for ecosystem health: different species play different roles, and variety can help ecosystems recover from disturbance. Threats include habitat loss, pollution, climate change, overharvesting, and invasive species. Conservation uses protected areas, laws, breeding programs, and habitat restoration. Endangered species are at risk of extinction; extinct means gone forever.",
    "realWorldExample": "Coral reefs have high biodiversity and support many fish and other species; when reefs die, those species suffer. Zoos and seed banks help save endangered species. Planting native plants helps local biodiversity.",
    "keyTerms": [
      {"term": "Biodiversity", "definition": "Variety of life at all levels: species, genes, and ecosystems."},
      {"term": "Endangered", "definition": "Species at risk of becoming extinct."},
      {"term": "Extinction", "definition": "When a species no longer exists anywhere on Earth."},
      {"term": "Habitat loss", "definition": "Destruction or fragmentation of where organisms live; a major cause of extinction."},
      {"term": "Invasive species", "definition": "Non-native species that spread and harm native species or ecosystems."},
      {"term": "Conservation", "definition": "Protection and sustainable use of natural resources and biodiversity."}
    ],
    "nsbTraps": [
      "Endangered means at risk; extinct means already gone. Don't use them interchangeably.",
      "Not all non-native species are invasive—only those that cause harm when they spread."
    ],
    "didYouKnow": [
      "We are in what some scientists call the sixth mass extinction—mainly due to human activity.",
      "Protecting keystone species (which have a big effect on the ecosystem) can help many other species."
    ],
    "relatedTopics": ["ls-ecology", "ls-biomes", "ls-symbiosis", "ls-evolution"]
  },
  {
    "id": "ps-motion",
    "subject": "Physical Science",
    "title": "Motion & Kinematics",
    "whatIsIt": "Motion describes how an object's position changes over time. Kinematics is the study of motion without considering the forces that cause it.",
    "howItWorks": "Speed is distance divided by time. Velocity is speed with direction. Acceleration is how quickly velocity changes. Distance-time graphs show position over time; the slope gives speed.",
    "realWorldExample": "A car's speedometer shows speed; when you brake, you feel acceleration (negative, because you're slowing down).",
    "keyTerms": [
      {"term": "Speed", "definition": "Distance traveled per unit time."},
      {"term": "Velocity", "definition": "Speed in a given direction."},
      {"term": "Acceleration", "definition": "Rate of change of velocity."}
    ],
    "nsbTraps": ["Speed is a scalar (no direction); velocity is a vector (has direction)."],
    "didYouKnow": ["Constant velocity means zero acceleration; constant speed in a straight line."],
    "relatedTopics": ["ps-newtons-laws"]
  },
  {
    "id": "ps-newtons-laws",
    "subject": "Physical Science",
    "title": "Newton's Three Laws of Motion",
    "whatIsIt": "Newton's three laws describe how forces affect the motion of objects. They are the foundation of classical mechanics.",
    "howItWorks": "First law: An object at rest stays at rest and an object in motion stays in motion at constant velocity unless acted on by a net force. Second law: F = ma (force equals mass times acceleration). Third law: For every action there is an equal and opposite reaction.",
    "realWorldExample": "When you push a shopping cart, it accelerates (second law). When you step off a boat, the boat moves backward (third law).",
    "keyTerms": [{"term": "Inertia", "definition": "Resistance to change in motion; from Newton's first law."}, {"term": "Net force", "definition": "The vector sum of all forces acting on an object."}],
    "nsbTraps": ["Weight is a force (mg); mass is not. Don't confuse them."],
    "didYouKnow": ["In outer space, with no friction, a small push can keep an object moving forever (first law)."],
    "relatedTopics": ["ps-motion"]
  },
  {
    "id": "ch-atomic-structure",
    "subject": "Chemistry",
    "title": "Atomic Structure",
    "whatIsIt": "Atoms are made of protons and neutrons in the nucleus, and electrons in shells around it. The number of protons defines the element.",
    "howItWorks": "Protons have positive charge, neutrons are neutral, electrons are negative. In a neutral atom, protons = electrons. The atomic number is the number of protons; mass number is protons + neutrons.",
    "realWorldExample": "Carbon has 6 protons; any atom with 6 protons is carbon, whether it has 6, 7, or 8 neutrons (isotopes).",
    "keyTerms": [
      {"term": "Proton", "definition": "Positively charged subatomic particle in the nucleus."},
      {"term": "Neutron", "definition": "Neutral subatomic particle in the nucleus."},
      {"term": "Electron", "definition": "Negatively charged particle outside the nucleus."}
    ],
    "nsbTraps": ["Isotopes have the same number of protons but different numbers of neutrons."],
    "didYouKnow": ["Most of an atom's volume is empty space; the nucleus is tiny compared to the electron cloud."],
    "relatedTopics": ["ch-periodic-table"]
  },
  {
    "id": "ch-periodic-table",
    "subject": "Chemistry",
    "title": "The Periodic Table",
    "whatIsIt": "The periodic table organizes all known elements by atomic number and groups elements with similar properties into columns.",
    "howItWorks": "Rows are periods (same number of electron shells); columns are groups (same number of valence electrons, so similar chemistry). Metals are on the left, nonmetals on the right, metalloids between.",
    "realWorldExample": "Group 1 (alkali metals) all have one valence electron and are highly reactive; Group 18 (noble gases) have full shells and are stable.",
    "keyTerms": [{"term": "Period", "definition": "A horizontal row on the periodic table."}, {"term": "Group", "definition": "A vertical column; elements in a group share similar properties."}],
    "nsbTraps": ["Atomic number is protons; atomic mass is roughly protons + neutrons. Don't confuse them."],
    "didYouKnow": ["Mendeleev left gaps for undiscovered elements and predicted their properties."],
    "relatedTopics": ["ch-atomic-structure"]
  },
  {
    "id": "es-earths-layers",
    "subject": "Earth & Space Science",
    "title": "Earth's Layers",
    "whatIsIt": "Earth has a thin crust, a thick mantle, a liquid outer core, and a solid inner core. The core is mostly iron and nickel.",
    "howItWorks": "The crust is solid rock. The mantle is solid but can flow slowly. The outer core is liquid metal and generates Earth's magnetic field. The inner core is solid due to extreme pressure.",
    "realWorldExample": "Earthquakes send waves through these layers; how the waves bend tells us about each layer's density and state.",
    "keyTerms": [
      {"term": "Crust", "definition": "Outermost solid layer of Earth."},
      {"term": "Mantle", "definition": "Thick layer between crust and core."},
      {"term": "Core", "definition": "Center of Earth; outer liquid, inner solid."}
    ],
    "nsbTraps": ["The mantle is solid, not liquid; it flows very slowly over long time scales."],
    "didYouKnow": ["The inner core may be as hot as the surface of the sun."],
    "relatedTopics": ["es-plate-tectonics"]
  },
  {
    "id": "es-plate-tectonics",
    "subject": "Earth & Space Science",
    "title": "Plate Tectonics",
    "whatIsIt": "Earth's lithosphere is broken into plates that move slowly on the asthenosphere. Their movement causes earthquakes, volcanoes, and mountain building.",
    "howItWorks": "Convection in the mantle drives plate motion. At divergent boundaries plates move apart; at convergent they collide (subduction or mountains); at transform boundaries they slide past each other.",
    "realWorldExample": "The Pacific Ring of Fire is where many plates meet; that's why there are so many earthquakes and volcanoes there.",
    "keyTerms": [{"term": "Lithosphere", "definition": "Rigid outer layer including crust and upper mantle."}, {"term": "Subduction", "definition": "When one plate sinks beneath another."}],
    "nsbTraps": ["Continental drift and plate tectonics are related; the theory was refined to include ocean floors."],
    "didYouKnow": ["The Himalayas are still rising as India pushes into Asia."],
    "relatedTopics": ["es-earths-layers"]
  },
  {
    "id": "en-forms",
    "subject": "Energy",
    "title": "Forms of Energy",
    "whatIsIt": "Energy exists in many forms: kinetic (motion), potential (stored), thermal, chemical, nuclear, electrical, and radiant. Energy can be converted from one form to another.",
    "howItWorks": "The law of conservation of energy says total energy in a closed system stays constant. When you drop a ball, potential energy becomes kinetic; when it hits the ground, some becomes thermal and sound.",
    "realWorldExample": "A battery stores chemical energy and converts it to electrical energy to run a phone.",
    "keyTerms": [
      {"term": "Kinetic energy", "definition": "Energy of motion."},
      {"term": "Potential energy", "definition": "Stored energy due to position or condition."},
      {"term": "Conservation of energy", "definition": "Energy cannot be created or destroyed, only transformed."}
    ],
    "nsbTraps": ["Energy is conserved; it doesn't disappear, it just changes form (often to heat)."],
    "didYouKnow": ["Food calories are a measure of chemical potential energy."],
    "relatedTopics": ["en-conservation"]
  },
  {
    "id": "en-conservation",
    "subject": "Energy",
    "title": "Energy Transformations & Conservation of Energy",
    "whatIsIt": "Energy can change from one form to another, but the total amount of energy in a closed system stays constant.",
    "howItWorks": "When you drop a ball, gravitational potential energy becomes kinetic energy. When it hits the ground, some becomes thermal and sound. No energy is lost—it's just converted. Friction often converts kinetic energy into heat.",
    "realWorldExample": "A roller coaster converts potential energy at the top of a hill into kinetic energy as it rolls down.",
    "keyTerms": [{"term": "Closed system", "definition": "A system that does not exchange energy with the outside."}, {"term": "Efficiency", "definition": "Useful energy output divided by energy input."}],
    "nsbTraps": ["Energy is conserved; 'using' energy means converting it to a less useful form (often heat), not destroying it."],
    "didYouKnow": ["Perpetual motion machines are impossible because of conservation of energy and friction."],
    "relatedTopics": ["en-forms"]
  },
  {
    "id": "math-pemdas",
    "subject": "Math",
    "title": "Order of Operations (PEMDAS)",
    "whatIsIt": "PEMDAS tells us the order to perform operations: Parentheses, Exponents, Multiplication and Division (left to right), Addition and Subtraction (left to right).",
    "howItWorks": "Do what's inside parentheses first. Then exponents. Then multiplication and division left to right. Finally addition and subtraction left to right.",
    "realWorldExample": "In 2 + 3 × 4, you multiply first (3 × 4 = 12), then add (2 + 12 = 14). If you added first you'd get 20, which is wrong.",
    "keyTerms": [
      {"term": "PEMDAS", "definition": "Order of operations: Parentheses, Exponents, Multiply, Divide, Add, Subtract."},
      {"term": "Expression", "definition": "A combination of numbers and operations."}
    ],
    "nsbTraps": ["Multiplication and division have the same priority; do them left to right. Same for add and subtract."],
    "didYouKnow": ["Some people remember PEMDAS as 'Please Excuse My Dear Aunt Sally.'"],
    "relatedTopics": []
  },
  {"id": "ps-forces","subject": "Physical Science","title": "Forces","whatIsIt": "A force is a push or pull that can change an object's motion or shape. Gravity, friction, normal force, and tension are common forces.","howItWorks": "Forces have magnitude and direction (they're vectors). Gravity pulls objects toward Earth (F = mg). Friction opposes motion between surfaces. The normal force is the support force perpendicular to a surface. Tension is the force in a string or rope. Net force determines acceleration (F = ma).","realWorldExample": "When you stand on the floor, the normal force from the floor balances gravity. When you pull a wagon, tension in the rope accelerates it; friction at the wheels opposes the motion.","keyTerms":[{"term": "Gravity","definition": "Force of attraction between masses; on Earth, pulls objects downward."},{"term": "Friction","definition": "Force that opposes motion between two surfaces in contact."},{"term": "Normal force","definition": "Perpendicular force a surface exerts on an object resting on it."},{"term": "Tension","definition": "Force transmitted through a string, rope, or cable when pulled."}],"nsbTraps": ["Weight is a force (mg); mass is not. Normal force is not always equal to weight—e.g., on an incline."],"didYouKnow": ["Friction can be helpful—without it you couldn't walk or brake a car."],"relatedTopics": ["ps-newtons-laws","ps-motion"]},
  {"id": "ps-work-energy-power","subject": "Physical Science","title": "Work, Energy & Power","whatIsIt": "Work is done when a force moves an object in the direction of the force. Energy is the ability to do work. Power is how fast work is done.","howItWorks": "Work W = F × d (force times distance in the direction of the force). If the force is at an angle, use the component in the direction of motion. Power P = work ÷ time (or P = F × v). The unit of work and energy is the joule; power is watts (joules per second).","realWorldExample": "Lifting a book does work against gravity. A more powerful motor can do the same work in less time.","keyTerms":[{"term": "Work","definition": "Force times distance in the direction of the force; measured in joules."},{"term": "Joule","definition": "Unit of work and energy; 1 J = 1 N·m."},{"term": "Power","definition": "Rate of doing work; measured in watts (W = J/s)."}],"nsbTraps": ["No work is done if the object doesn't move in the direction of the force—holding a heavy bag still does no work."],"didYouKnow": ["A watt is named after James Watt; a 100 W light bulb uses 100 joules per second."],"relatedTopics": ["ps-newtons-laws","ps-kinetic-potential"]},
  {"id": "ps-kinetic-potential","subject": "Physical Science","title": "Kinetic & Potential Energy","whatIsIt": "Kinetic energy is energy of motion (KE = ½mv²). Potential energy is stored energy—gravitational PE = mgh, elastic PE in springs.","howItWorks": "The faster or heavier an object, the more kinetic energy. Gravitational potential energy depends on mass, height, and g. When an object falls, PE is converted to KE. Elastic potential energy is ½kx² for a spring (k = spring constant).","realWorldExample": "A roller coaster at the top of a hill has maximum PE; at the bottom it has maximum KE. A stretched rubber band has elastic PE.","keyTerms":[{"term": "Kinetic energy","definition": "Energy of motion; KE = ½mv²."},{"term": "Gravitational potential energy","definition": "Stored energy due to height; PE = mgh."},{"term": "Elastic potential energy","definition": "Energy stored in stretched or compressed springs."}],"nsbTraps": ["PE depends on the reference level—choose where h = 0 consistently. Double the speed means four times the KE."],"didYouKnow": ["Energy is a scalar—it has no direction, only magnitude."],"relatedTopics": ["ps-work-energy-power","en-forms"]},
  {"id": "ps-simple-machines","subject": "Physical Science","title": "Simple Machines","whatIsIt": "Simple machines make work easier by changing the size or direction of the force. The six types are lever, pulley, inclined plane, wheel and axle, wedge, and screw.","howItWorks": "They don't reduce the total work (work in = work out, ignoring friction) but they trade force for distance or vice versa. A lever has a fulcrum; moving the fulcrum changes the mechanical advantage. A pulley can change direction or multiply force. Inclined planes reduce the force needed to lift by increasing distance.","realWorldExample": "Scissors are double levers. A ramp is an inclined plane. A screw is an inclined plane wrapped around a cylinder.","keyTerms":[{"term": "Lever","definition": "Rigid bar that pivots on a fulcrum to multiply force or distance."},{"term": "Pulley","definition": "Wheel with a groove for a rope; can change direction or provide mechanical advantage."},{"term": "Inclined plane","definition": "Sloped surface that reduces the force needed to lift an object."},{"term": "Mechanical advantage","definition": "Ratio of output force to input force (or input distance to output distance)."}],"nsbTraps": ["Simple machines don't create energy—they trade force for distance. Ideal MA ignores friction."],"didYouKnow": ["Archimedes said he could move the Earth with a lever long enough."],"relatedTopics": ["ps-work-energy-power","ps-forces"]},
  {"id": "ps-momentum","subject": "Physical Science","title": "Momentum & Impulse","whatIsIt": "Momentum is mass times velocity (p = mv). Impulse is the change in momentum, equal to force times time (J = FΔt).","howItWorks": "Momentum is conserved in a closed system with no net external force—total p before = total p after. Impulse = FΔt = Δp. A large force for a short time can give the same impulse as a small force for a long time (e.g., airbags extend the time to reduce force).","realWorldExample": "When a baseball bat hits a ball, the impulse changes the ball's momentum. Catching a ball with bent arms extends the time and reduces the force on your hand.","keyTerms":[{"term": "Momentum","definition": "Mass times velocity; p = mv; a vector."},{"term": "Impulse","definition": "Change in momentum; J = FΔt = Δp."},{"term": "Conservation of momentum","definition": "In a closed system with no net external force, total momentum is constant."}],"nsbTraps": ["Momentum is a vector—direction matters. In collisions, total momentum is conserved, not necessarily kinetic energy."],"didYouKnow": ["Rocket propulsion works by conservation of momentum—the rocket pushes exhaust backward, so the rocket moves forward."],"relatedTopics": ["ps-newtons-laws","ps-motion"]},
  {"id": "ps-waves","subject": "Physical Science","title": "Waves: Properties","whatIsIt": "Waves transfer energy without transferring matter. They have wavelength, frequency, amplitude, and speed.","howItWorks": "Wavelength (λ) is the distance between two similar points. Frequency (f) is how many waves pass per second (Hz). Speed v = fλ. Amplitude is the maximum displacement from rest—it relates to energy. Transverse waves (e.g., light) oscillate perpendicular to direction of travel; longitudinal (e.g., sound) oscillate parallel.","realWorldExample": "Ripples on water, sound, and light are all waves. A higher frequency sound has a higher pitch.","keyTerms":[{"term": "Wavelength","definition": "Distance between two consecutive similar points on a wave (e.g., crest to crest)."},{"term": "Frequency","definition": "Number of waves per second; unit is hertz (Hz)."},{"term": "Amplitude","definition": "Maximum displacement from equilibrium; related to wave energy."},{"term": "Speed","definition": "v = fλ; speed of a wave depends on the medium."}],"nsbTraps": ["When a wave enters a new medium, frequency usually stays the same but wavelength and speed can change."],"didYouKnow": ["Ocean waves are a combination of transverse and longitudinal motion."],"relatedTopics": ["ps-sound","ps-light"]},
  {"id": "ps-sound","subject": "Physical Science","title": "Sound Waves","whatIsIt": "Sound is a longitudinal wave that travels through a medium (air, water, solid). Pitch is related to frequency; volume (loudness) is related to amplitude.","howItWorks": "Vibrating objects create compressions and rarefactions in the medium. Higher frequency means higher pitch. The Doppler effect: when source or listener moves, the perceived frequency changes (e.g., siren sounds higher as it approaches). Sound cannot travel in a vacuum.","realWorldExample": "A guitar string vibrates to produce sound. An ambulance siren sounds higher when it's coming toward you and lower when it passes.","keyTerms":[{"term": "Pitch","definition": "How high or low a sound is; determined by frequency."},{"term": "Doppler effect","definition": "Change in perceived frequency when source or observer is moving."},{"term": "Longitudinal wave","definition": "Wave in which the medium vibrates parallel to the direction of travel."}],"nsbTraps": ["Sound needs a medium; light can travel in a vacuum. Pitch is frequency; loudness is amplitude."],"didYouKnow": ["Humans hear roughly 20 Hz to 20,000 Hz; ultrasound is above our range."],"relatedTopics": ["ps-waves","ps-light"]},
  {"id": "ps-light","subject": "Physical Science","title": "Light & Electromagnetic Spectrum","whatIsIt": "Light is an electromagnetic wave. The EM spectrum includes radio, microwave, infrared, visible light, ultraviolet, X-rays, and gamma rays—all the same type of wave but different wavelengths and frequencies.","howItWorks": "EM waves don't need a medium; they travel at the speed of light in a vacuum (c ≈ 3×10⁸ m/s). Visible light is a small part of the spectrum. Higher frequency means higher energy (E = hf). Wavelength and frequency are related by c = fλ.","realWorldExample": "Radio waves carry music to your phone. Infrared is heat you feel. UV from the sun can sunburn. X-rays pass through soft tissue but not bone.","keyTerms":[{"term": "Electromagnetic wave","definition": "Wave of electric and magnetic fields; includes light, radio, X-rays."},{"term": "Wavelength","definition": "Distance for one cycle; shorter wavelength means higher frequency and energy."},{"term": "Visible light","definition": "Narrow range of the EM spectrum that human eyes can see (roughly 400–700 nm)."}],"nsbTraps": ["All EM waves travel at the same speed in a vacuum. 'Light' in physics often means all EM radiation, not just visible."],"didYouKnow": ["The speed of light is the cosmic speed limit—nothing with mass can reach it."],"relatedTopics": ["ps-waves","ps-reflection-refraction"]},
  {"id": "ps-reflection-refraction","subject": "Physical Science","title": "Reflection & Refraction","whatIsIt": "Reflection is when light bounces off a surface (angle of incidence = angle of reflection). Refraction is when light bends as it enters a new medium (e.g., from air to water).","howItWorks": "Law of reflection: angle of incidence = angle of reflection. Refraction obeys Snell's law: n₁sinθ₁ = n₂sinθ₂, where n is the index of refraction. When light goes into a denser medium (higher n), it bends toward the normal. Dispersion is when different wavelengths refract differently (e.g., rainbow).","realWorldExample": "A mirror reflects your image. A straw in water looks bent because of refraction. Prisms separate white light into colors.","keyTerms":[{"term": "Angle of incidence","definition": "Angle between incoming ray and the normal to the surface."},{"term": "Refraction","definition": "Bending of light when it passes from one medium to another."},{"term": "Index of refraction","definition": "n = c/v; how much light slows in a medium; n > 1."}],"nsbTraps": ["Reflection: angle is measured from the normal, not the surface. When n increases, light bends toward the normal."],"didYouKnow": ["A mirage is caused by refraction in layers of air at different temperatures."],"relatedTopics": ["ps-light","ps-optics"]},
  {"id": "ps-optics","subject": "Physical Science","title": "Optics","whatIsIt": "Optics is the study of how lenses and mirrors form images. Convex lenses converge light; concave lenses diverge it. Mirrors can be plane, concave (converging), or convex (diverging).","howItWorks": "Convex (converging) lenses can form real or virtual images depending on object distance. Concave (diverging) lenses always form virtual, upright, smaller images. Focal length f is where parallel rays converge. Mirror and lens equations relate object distance, image distance, and focal length.","realWorldExample": "Magnifying glasses are convex lenses. Car side mirrors are often convex to show a wider view. Concave mirrors are used in flashlights to focus light.","keyTerms":[{"term": "Convex lens","definition": "Lens that is thicker in the center; converges parallel light to a focal point."},{"term": "Concave lens","definition": "Lens that is thinner in the center; diverges light."},{"term": "Focal length","definition": "Distance from lens or mirror to the focal point."}],"nsbTraps": ["Real images can be projected on a screen; virtual images cannot. Convex lens can do either; concave lens only virtual."],"didYouKnow": ["Your eye has a convex lens that focuses light onto the retina."],"relatedTopics": ["ps-reflection-refraction","ps-light"]},
  {"id": "ps-electricity","subject": "Physical Science","title": "Electricity","whatIsIt": "Electricity involves electric charge, current (flow of charge), voltage (energy per charge), and resistance. Ohm's Law relates them: V = IR.","howItWorks": "Charge is measured in coulombs; like charges repel, opposite attract. Current I is charge per time (amperes). Voltage V is potential difference (volts). Resistance R (ohms) opposes current. V = IR. Power P = IV = I²R.","realWorldExample": "A battery provides voltage; when you connect a wire and bulb, current flows and the bulb lights. More resistance means less current for the same voltage.","keyTerms":[{"term": "Current","definition": "Rate of flow of electric charge; I = Q/t; unit ampere (A)."},{"term": "Voltage","definition": "Electric potential difference; energy per charge; unit volt (V)."},{"term": "Resistance","definition": "Opposition to current; R = V/I; unit ohm (Ω)."},{"term": "Ohm's Law","definition": "V = IR (voltage = current × resistance)."}],"nsbTraps": ["Current is the same through series elements; voltage is the same across parallel branches. Don't confuse V and I."],"didYouKnow": ["Static electricity is charge that isn't moving; current electricity is charge in motion."],"relatedTopics": ["ps-circuits","en-forms"]},
  {"id": "ps-circuits","subject": "Physical Science","title": "Circuits","whatIsIt": "An electric circuit is a closed path for current. In series, components are in one loop (same current); in parallel, components have separate branches (same voltage across each branch).","howItWorks": "Series: total R = R₁ + R₂ + …; same I through all. Parallel: 1/R_total = 1/R₁ + 1/R₂ + …; same V across each branch; currents add. Kirchhoff's rules: current into a junction = current out; sum of voltages around a loop = 0.","realWorldExample": "Old Christmas lights in series: one bulb out, all go out. House wiring is parallel so each outlet gets the same voltage.","keyTerms":[{"term": "Series circuit","definition": "Components in a single loop; same current through each."},{"term": "Parallel circuit","definition": "Components in separate branches; same voltage across each branch."},{"term": "Resistor","definition": "Component that limits current; obeys Ohm's Law."}],"nsbTraps": ["In series, adding resistors increases total R. In parallel, adding resistors decreases total R."],"didYouKnow": ["Batteries in series add voltage; in parallel they can provide more current for the same voltage."],"relatedTopics": ["ps-electricity","ps-magnetism"]},
  {"id": "ps-magnetism","subject": "Physical Science","title": "Magnetism & Electromagnetism","whatIsIt": "Magnets have north and south poles; like poles repel, opposite attract. Electric current produces a magnetic field; a changing magnetic field can induce current (electromagnetic induction).","howItWorks": "Magnetic field lines go from N to S. A current in a wire creates a circular field around it. A solenoid (coil) acts like a bar magnet. Moving a magnet through a coil (or changing the field) induces a voltage and current—this is how generators work. Motors use the force on a current in a magnetic field to spin.","realWorldExample": "Compass needles align with Earth's magnetic field. Generators convert motion to electricity; motors convert electricity to motion.","keyTerms":[{"term": "Magnetic field","definition": "Region around a magnet (or current) where magnetic force acts."},{"term": "Electromagnet","definition": "Magnet made by current in a coil; can be turned on and off."},{"term": "Electromagnetic induction","definition": "Inducing voltage/current by changing magnetic flux through a loop."}],"nsbTraps": ["You can't have a single magnetic pole (monopole)—they come in N-S pairs. Right-hand rule gives field direction."],"didYouKnow": ["Earth's magnetic field protects us from charged particles from the sun."],"relatedTopics": ["ps-electricity","ps-circuits"]},
  {"id": "ps-thermodynamics","subject": "Physical Science","title": "Heat & Thermodynamics","whatIsIt": "Heat is energy transferred due to temperature difference. The three ways are conduction (direct contact), convection (fluid flow), and radiation (EM waves).","howItWorks": "Heat flows from hot to cold. Specific heat is the energy needed to raise 1 kg by 1°C—water has high specific heat. First law: energy is conserved (heat in = work out + change in internal energy). Second law: heat cannot spontaneously flow from cold to hot.","realWorldExample": "A metal spoon in hot soup gets hot by conduction. Boiling water has convection currents. The sun warms Earth by radiation.","keyTerms":[{"term": "Conduction","definition": "Heat transfer by direct contact between particles."},{"term": "Convection","definition": "Heat transfer by movement of a fluid (liquid or gas)."},{"term": "Radiation","definition": "Heat transfer by electromagnetic waves; no medium needed."},{"term": "Specific heat","definition": "Energy per mass per temperature change; water has high specific heat."}],"nsbTraps": ["Temperature and heat are different—temperature is average KE; heat is energy transferred. Objects don't 'contain heat' in the same way they contain mass."],"didYouKnow": ["Thermal expansion: most materials expand when heated—why bridges have expansion joints."],"relatedTopics": ["ps-states-of-matter","en-forms"]},
  {"id": "ps-states-of-matter","subject": "Physical Science","title": "States of Matter & Phase Changes","whatIsIt": "The three common states are solid, liquid, and gas. Phase changes (melting, freezing, boiling, condensation, sublimation) occur at fixed temperatures when energy is added or removed.","howItWorks": "Solids have fixed shape and volume; liquids have fixed volume but take container shape; gases fill the container. Melting/freezing at melting point; boiling/condensation at boiling point. During a phase change, temperature stays constant while energy goes into breaking or forming bonds. Sublimation is solid to gas (e.g., dry ice).","realWorldExample": "Ice melts at 0°C; water boils at 100°C. Sweat evaporating cools you because it takes heat from your skin.","keyTerms":[{"term": "Melting","definition": "Phase change from solid to liquid."},{"term": "Boiling","definition": "Phase change from liquid to gas at the boiling point."},{"term": "Sublimation","definition": "Phase change directly from solid to gas (e.g., dry ice)."}],"nsbTraps": ["During a phase change, temperature doesn't change even though you're adding heat—the energy goes into the phase change."],"didYouKnow": ["Deposition is the reverse of sublimation—gas to solid (e.g., frost)."],"relatedTopics": ["ps-thermodynamics","ch-atomic-structure"]},
  {"id": "ps-pressure-fluids","subject": "Physical Science","title": "Pressure & Fluids","whatIsIt": "Pressure is force per unit area (P = F/A). Fluids (liquids and gases) exert pressure. Pascal's law: pressure in a fluid is transmitted equally in all directions. Buoyancy and Archimedes' principle explain why things float.","howItWorks": "Pressure in a fluid increases with depth (P = ρgh for a liquid). Pascal's principle: applied pressure in an enclosed fluid is transmitted undiminished. Archimedes' principle: buoyant force = weight of fluid displaced. An object floats if its density is less than the fluid's.","realWorldExample": "Dams are thicker at the bottom because pressure increases with depth. Submarines control buoyancy by changing the amount of water in ballast tanks.","keyTerms":[{"term": "Pressure","definition": "Force per unit area; P = F/A; unit pascal (Pa)."},{"term": "Pascal's Law","definition": "Pressure applied to an enclosed fluid is transmitted equally to every part."},{"term": "Archimedes' Principle","definition": "Buoyant force on an object equals the weight of fluid it displaces."}],"nsbTraps": ["Pressure depends on depth and density, not total volume. Buoyancy depends on displaced volume, not the object's weight alone."],"didYouKnow": ["Hydraulic brakes use Pascal's principle—small force on a small area becomes large force on a large area."],"relatedTopics": ["ps-forces","ps-thermodynamics"]},
  {"id": "ps-nuclear","subject": "Physical Science","title": "Nuclear Physics Basics","whatIsIt": "Nuclear physics involves the nucleus—fission (splitting heavy nuclei), fusion (combining light nuclei), and radioactive decay (unstable nuclei emitting particles).","howItWorks": "Fission: a heavy nucleus (e.g., uranium) splits into smaller nuclei plus neutrons and energy. Fusion: light nuclei (e.g., hydrogen) combine to form heavier nuclei and release energy (powers the sun). Radioactive decay: alpha (helium nucleus), beta (electron or positron), gamma (high-energy photon)—each changes the nucleus.","realWorldExample": "Nuclear power plants use fission. The sun uses fusion. Radon in basements is from decay of uranium in rock.","keyTerms":[{"term": "Fission","definition": "Splitting of a heavy nucleus into smaller parts; releases energy."},{"term": "Fusion","definition": "Combining light nuclei into heavier ones; releases energy (e.g., in the sun)."},{"term": "Radioactive decay","definition": "Unstable nucleus emits particles or radiation to become more stable."}],"nsbTraps": ["Fission and fusion are opposite—fission splits, fusion combines. Both can release energy in the right conditions."],"didYouKnow": ["Half-life is the time for half of a radioactive sample to decay—it's constant for each isotope."],"relatedTopics": ["ch-atomic-structure","en-forms"]},
  {"id": "ch-elements-compounds","subject": "Chemistry","title": "Elements, Compounds & Mixtures","whatIsIt": "An element is a pure substance made of one type of atom. A compound is two or more elements chemically bonded in fixed ratios. A mixture is a combination of substances not chemically bonded.","howItWorks": "Elements are on the periodic table (e.g., oxygen, carbon). Compounds have a fixed composition (e.g., H₂O is always 2:1 H to O). Mixtures can be homogeneous (same throughout, e.g., salt water) or heterogeneous (e.g., salad). Compounds can only be separated by chemical means; mixtures by physical means (filtering, distillation).","realWorldExample": "Air is a mixture of nitrogen, oxygen, and other gases. Table salt is the compound NaCl. Gold is an element.","keyTerms":[{"term": "Element","definition": "Pure substance made of one type of atom; cannot be broken down by chemical means."},{"term": "Compound","definition": "Substance made of two or more elements in a fixed ratio; can be broken down chemically."},{"term": "Mixture","definition": "Combination of substances not chemically bonded; can be separated physically."}],"nsbTraps": ["Compounds have fixed composition; mixtures can vary. Don't confuse compound with mixture."],"didYouKnow": ["Water is a compound; seawater is a mixture (water plus salts and other substances)."],"relatedTopics": ["ch-atomic-structure","ch-periodic-table"]},
  {"id": "ch-chemical-bonds","subject": "Chemistry","title": "Chemical Bonds","whatIsIt": "Chemical bonds hold atoms together in compounds. Ionic bonds form when electrons are transferred (metal + nonmetal). Covalent bonds form when electrons are shared (often nonmetal + nonmetal). Hydrogen bonds are weak attractions between molecules.","howItWorks": "Ionic: one atom donates electrons, another accepts; result is ions that attract (e.g., Na⁺Cl⁻). Covalent: atoms share electron pairs; can be single, double, or triple bonds. Polar covalent means unequal sharing (e.g., H₂O). Hydrogen bonds: H bonded to O, N, or F is attracted to another O, N, or F—important in DNA and water.","realWorldExample": "Table salt is ionic. Sugar and water have covalent bonds. Hydrogen bonds give water its high boiling point and hold DNA strands together.","keyTerms":[{"term": "Ionic bond","definition": "Bond formed by transfer of electrons; typically metal + nonmetal."},{"term": "Covalent bond","definition": "Bond formed by sharing electron pairs between atoms."},{"term": "Hydrogen bond","definition": "Weak attraction between H (on O, N, F) and another O, N, or F."}],"nsbTraps": ["Ionic compounds form crystals and often dissolve in water; covalent molecules can be gases, liquids, or solids. Don't say 'covalent crystal' when you mean ionic."],"didYouKnow": ["The strength of chemical bonds is why some reactions release energy (bonds formed) and others absorb it (bonds broken)."],"relatedTopics": ["ch-atomic-structure","ch-chemical-reactions"]},
  {"id": "ch-chemical-reactions","subject": "Chemistry","title": "Chemical Reactions","whatIsIt": "A chemical reaction rearranges atoms; reactants become products. The number of each type of atom is conserved—equations must be balanced.","howItWorks": "Reactants are on the left, products on the right. Coefficients show how many of each molecule (e.g., 2H₂ + O₂ → 2H₂O). Subscripts show atoms per molecule and cannot be changed when balancing—only coefficients can. Balance one element at a time.","realWorldExample": "Burning: fuel + O₂ → CO₂ + H₂O. Rusting: iron + oxygen → iron oxide. Photosynthesis and respiration are chemical reactions.","keyTerms":[{"term": "Reactant","definition": "Starting substance in a chemical reaction (left side of equation)."},{"term": "Product","definition": "Substance produced in a reaction (right side)."},{"term": "Balanced equation","definition": "Equation where the number of each type of atom is the same on both sides."}],"nsbTraps": ["Never change subscripts to balance—that changes the compound. Only change coefficients."],"didYouKnow": ["Catalysts speed up reactions but are not consumed—they appear in the equation but can be written over the arrow."],"relatedTopics": ["ch-chemical-bonds","ch-reaction-types"]},
  {"id": "ch-reaction-types","subject": "Chemistry","title": "Types of Chemical Reactions","whatIsIt": "Common types include synthesis (A + B → C), decomposition (C → A + B), single displacement (A + BC → AC + B), double displacement (AB + CD → AD + CB), and combustion (fuel + O₂ → CO₂ + H₂O).","howItWorks": "Synthesis combines two or more into one. Decomposition breaks one into two or more. Single displacement: one element replaces another in a compound. Double displacement: ions swap partners. Combustion: reaction with oxygen, often producing CO₂ and H₂O.","realWorldExample": "Rust is synthesis (iron + oxygen). Hydrogen peroxide decomposing is decomposition. Burning wood is combustion.","keyTerms":[{"term": "Synthesis","definition": "Reaction where two or more substances combine to form one product."},{"term": "Decomposition","definition": "Reaction where one substance breaks into two or more."},{"term": "Combustion","definition": "Reaction with oxygen; often releases heat and light; produces CO₂ and H₂O for organic fuels."}],"nsbTraps": ["Combustion always involves O₂ as a reactant. Double displacement often forms a precipitate (solid) or water."],"didYouKnow": ["Many reactions in your body are oxidation-reduction (redox) reactions."],"relatedTopics": ["ch-chemical-reactions","ch-acids-bases"]},
  {"id": "ch-acids-bases","subject": "Chemistry","title": "Acids & Bases","whatIsIt": "Acids donate H⁺ (protons); bases accept H⁺ or donate OH⁻. The pH scale (0–14) measures acidity: pH < 7 is acid, 7 is neutral, > 7 is base.","howItWorks": "Strong acids fully ionize in water (e.g., HCl → H⁺ + Cl⁻). Strong bases fully dissociate (e.g., NaOH → Na⁺ + OH⁻). pH = -log[H⁺]; each step is 10×. Neutralization: acid + base → salt + water. Indicators (e.g., litmus, phenolphthalein) change color with pH.","realWorldExample": "Lemon juice and vinegar are acids. Soap and baking soda are bases. Stomach acid is HCl; antacids are bases that neutralize it.","keyTerms":[{"term": "pH","definition": "Measure of acidity; pH = -log[H⁺]; 7 is neutral, <7 acid, >7 base."},{"term": "Neutralization","definition": "Reaction of acid and base to form salt and water."},{"term": "Indicator","definition": "Substance that changes color with pH (e.g., litmus)."}],"nsbTraps": ["pH 4 is 10× more acidic than pH 5, not 1×. Don't confuse strength (degree of ionization) with concentration."],"didYouKnow": ["Buffers resist pH change—blood has buffers to keep pH around 7.4."],"relatedTopics": ["ch-chemical-reactions","ch-solutions"]},
  {"id": "ch-mole","subject": "Chemistry","title": "The Mole & Molar Mass","whatIsIt": "The mole is a count of particles: 1 mole = 6.02×10²³ particles (Avogadro's number). Molar mass is the mass of one mole of a substance (g/mol)—numerically equal to the formula mass in amu.","howItWorks": "Formula mass (or molecular mass) is the sum of atomic masses in the formula. Molar mass in g/mol has the same number. Moles = mass ÷ molar mass. Number of particles = moles × 6.02×10²³.","realWorldExample": "One mole of carbon-12 is 12 grams. One mole of water is 18 g and contains 6.02×10²³ H₂O molecules.","keyTerms":[{"term": "Mole","definition": "Amount of substance containing Avogadro's number (6.02×10²³) of particles."},{"term": "Molar mass","definition": "Mass of one mole of a substance; g/mol; same number as formula mass in amu."},{"term": "Avogadro's number","definition": "6.02×10²³; number of particles in one mole."}],"nsbTraps": ["Molar mass of O₂ is 32 g/mol (two oxygen atoms), not 16. Always use the formula."],"didYouKnow": ["The mole lets chemists count atoms by weighing—you can't count 10²³ atoms one by one."],"relatedTopics": ["ch-periodic-table","ch-chemical-reactions"]},
  {"id": "ch-states-matter","subject": "Chemistry","title": "States of Matter at the Molecular Level","whatIsIt": "In solids, particles are close and vibrate in place. In liquids, they slide past each other. In gases, they move freely and are far apart.","howItWorks": "Kinetic molecular theory: particles are in constant motion; temperature is related to average kinetic energy. Solids have strong attractions and fixed positions; liquids have moderate attractions; gases have weak attractions and fill the container. Pressure in a gas comes from collisions with the walls.","realWorldExample": "Ice (solid) has ordered molecules; water (liquid) has molecules that can flow; steam (gas) has molecules moving fast and far apart.","keyTerms":[{"term": "Kinetic molecular theory","definition": "Model that explains gas behavior: particles in constant motion, collisions are elastic."},{"term": "Pressure","definition": "In gases, caused by collisions of particles with the container walls."}],"nsbTraps": ["Gas particles do have volume and attractions—ideal gas model ignores them for simplicity. Real gases deviate at high P and low T."],"didYouKnow": ["Absolute zero (0 K) is when particle motion is at a minimum (theoretical)."],"relatedTopics": ["ps-states-of-matter","ch-atomic-structure"]},
  {"id": "ch-solutions","subject": "Chemistry","title": "Solutions & Solubility","whatIsIt": "A solution is a homogeneous mixture of solute (dissolved) and solvent (does the dissolving). Solubility is how much solute can dissolve in a given amount of solvent at a given temperature.","howItWorks": "Like dissolves like: polar solvents (e.g., water) dissolve polar and ionic solutes; nonpolar solvents dissolve nonpolar solutes. Concentration can be expressed as mass/volume, percent, or molarity (moles per liter). Saturated solution has maximum dissolved solute; adding more won't dissolve.","realWorldExample": "Sugar dissolves in water. Oil doesn't dissolve in water (nonpolar vs polar). Carbonated soda has CO₂ dissolved under pressure.","keyTerms":[{"term": "Solute","definition": "Substance that is dissolved in a solution."},{"term": "Solvent","definition": "Substance that does the dissolving (e.g., water in salt water)."},{"term": "Solubility","definition": "Maximum amount of solute that can dissolve in a given amount of solvent at a given T."},{"term": "Saturated","definition": "Solution that has dissolved the maximum amount of solute possible."}],"nsbTraps": ["Increasing temperature usually increases solubility of solids in liquids but can decrease solubility of gases."],"didYouKnow": ["Supersaturated solutions hold more than the normal maximum—they're unstable and can crystallize suddenly."],"relatedTopics": ["ch-acids-bases","ch-chemical-bonds"]},
  {"id": "ch-redox","subject": "Chemistry","title": "Oxidation & Reduction","whatIsIt": "Oxidation is loss of electrons; reduction is gain of electrons. They always occur together (redox). The substance that is oxidized loses electrons to the substance that is reduced.","howItWorks": "LEO says GER: Loss of Electrons is Oxidation; Gain of Electrons is Reduction. Oxidizing agent gets reduced (takes electrons); reducing agent gets oxidized (gives electrons). Oxidation numbers track electron transfer. Corrosion (e.g., rusting) is oxidation of metal.","realWorldExample": "When iron rusts, iron is oxidized (loses electrons) and oxygen is reduced. Batteries use redox reactions to produce current.","keyTerms":[{"term": "Oxidation","definition": "Loss of electrons; oxidation number increases."},{"term": "Reduction","definition": "Gain of electrons; oxidation number decreases."},{"term": "Oxidizing agent","definition": "Substance that accepts electrons; it gets reduced."},{"term": "Reducing agent","definition": "Substance that donates electrons; it gets oxidized."}],"nsbTraps": ["Reduction doesn't mean 'getting smaller'—it means gaining electrons. The name is historical."],"didYouKnow": ["Photosynthesis and cellular respiration are both series of redox reactions."],"relatedTopics": ["ch-chemical-reactions","ps-electricity"]},
  {"id": "ch-organic","subject": "Chemistry","title": "Organic Chemistry Basics","whatIsIt": "Organic chemistry is the study of carbon-containing compounds. Carbon can form four bonds and long chains, so there are millions of organic compounds. Hydrocarbons contain only C and H; polymers are long chains of repeating units.","howItWorks": "Hydrocarbons can be alkanes (single bonds), alkenes (double bonds), alkynes (triple bonds). Functional groups (e.g., -OH, -COOH) give molecules specific properties. Polymers are made of monomers joined together (e.g., plastics, proteins, DNA).","realWorldExample": "Methane (CH₄) is natural gas. Ethanol has -OH. Plastics are polymers. Fats, proteins, and carbohydrates are organic.","keyTerms":[{"term": "Hydrocarbon","definition": "Compound containing only carbon and hydrogen."},{"term": "Polymer","definition": "Large molecule made of many repeating monomer units."},{"term": "Organic compound","definition": "Compound containing carbon (with some exceptions like CO₂)."}],"nsbTraps": ["Not all carbon compounds are from living things—plastics are synthetic organic compounds."],"didYouKnow": ["DNA and proteins are organic polymers—life is based on carbon chemistry."],"relatedTopics": ["ch-chemical-bonds","ls-dna-rna"]},
  {"id": "ch-nuclear-chem","subject": "Chemistry","title": "Nuclear Chemistry","whatIsIt": "Nuclear chemistry involves changes in the nucleus—radioactive decay, half-life, and uses in medicine and energy. Isotopes are atoms of the same element with different numbers of neutrons.","howItWorks": "Unstable (radioactive) nuclei decay by emitting alpha (⁴He nucleus), beta (electron or positron), or gamma (photon). Half-life is the time for half the nuclei to decay—it's constant for each isotope. Carbon-14 dating uses half-life to estimate age of organic material.","realWorldExample": "Uranium-238 decays slowly (long half-life). Medical imaging uses radioactive tracers. Nuclear power uses fission.","keyTerms":[{"term": "Isotope","definition": "Atoms of the same element with the same number of protons but different number of neutrons."},{"term": "Half-life","definition": "Time for half of a radioactive sample to decay; constant for each isotope."},{"term": "Alpha decay","definition": "Emission of a helium nucleus (2 protons, 2 neutrons)."}],"nsbTraps": ["Half-life doesn't depend on amount—whether you have 1 g or 1000 g, half decays in the same time."],"didYouKnow": ["Carbon-14 has a half-life of about 5,730 years—used to date fossils and artifacts."],"relatedTopics": ["ch-atomic-structure","ps-nuclear"]},
  {"id": "es-earthquakes","subject": "Earth & Space Science","title": "Earthquakes","whatIsIt": "Earthquakes are sudden shaking of the ground caused by movement along faults when stress is released. Seismic waves travel through and along Earth's surface.","howItWorks": "Energy is stored as stress when plates stick; when it's released, the fault slips and seismic waves radiate. P-waves (primary) are longitudinal and fastest; S-waves (secondary) are transverse and don't travel through liquid. Surface waves cause the most damage. The Richter scale (and moment magnitude) measure strength.","realWorldExample": "The San Andreas Fault in California is a transform boundary where earthquakes are common. Tsunamis can be triggered by undersea quakes.","keyTerms":[{"term": "Fault","definition": "Break in rock where movement can occur; earthquakes happen when fault slips."},{"term": "P-wave","definition": "Primary wave; longitudinal; travels through solids and liquids; fastest."},{"term": "S-wave","definition": "Secondary wave; transverse; travels only through solids."},{"term": "Richter scale","definition": "Scale that measures earthquake magnitude (logarithmic)."}],"nsbTraps": ["P-waves arrive first, then S-waves. S-waves don't go through the outer core—that's how we know it's liquid."],"didYouKnow": ["The epicenter is the point on the surface above the focus (where the rupture starts underground)."],"relatedTopics": ["es-plate-tectonics","es-earths-layers"]},
  {"id": "es-volcanoes","subject": "Earth & Space Science","title": "Volcanoes","whatIsIt": "Volcanoes form where magma (molten rock below ground) reaches the surface. Lava is magma that has erupted. Volcanoes occur at divergent and convergent boundaries and at hot spots.","howItWorks": "At convergent boundaries, subducting plate melts and magma rises. At divergent boundaries, magma rises at mid-ocean ridges. Hot spots are fixed plumes of mantle material (e.g., Hawaii). Eruptions can be explosive (viscous, gas-rich magma) or effusive (runny lava).","realWorldExample": "Mount St. Helens is at a convergent boundary. Iceland is on the Mid-Atlantic Ridge. Hawaii is a hot-spot chain.","keyTerms":[{"term": "Magma","definition": "Molten rock below Earth's surface."},{"term": "Lava","definition": "Magma that has erupted onto the surface."},{"term": "Hot spot","definition": "Fixed source of magma that can create a chain of volcanoes as the plate moves."}],"nsbTraps": ["Magma is underground; lava is on the surface. Not all magma becomes lava—some cools underground."],"didYouKnow": ["The Ring of Fire around the Pacific has most of the world's volcanoes and earthquakes."],"relatedTopics": ["es-plate-tectonics","es-earthquakes"]},
  {"id": "es-rock-cycle","subject": "Earth & Space Science","title": "Rocks & the Rock Cycle","whatIsIt": "Rocks are classified as igneous (from cooled magma/lava), sedimentary (from sediment or precipitation), or metamorphic (changed by heat and pressure). The rock cycle shows how they transform.","howItWorks": "Igneous: magma/lava cools and crystallizes. Sedimentary: weathering and erosion produce sediment; compaction and cementation form rock. Metamorphic: existing rock is changed by heat and pressure without melting. Any rock can become any other type over geologic time.","realWorldExample": "Granite is igneous. Sandstone is sedimentary. Marble is metamorphic limestone.","keyTerms":[{"term": "Igneous rock","definition": "Rock formed from cooling and solidification of magma or lava."},{"term": "Sedimentary rock","definition": "Rock formed from sediment or chemical precipitation; often in layers."},{"term": "Metamorphic rock","definition": "Rock changed by heat and pressure; can have foliation (layers)."}],"nsbTraps": ["Sedimentary doesn't mean 'from sediment' only—chemical sedimentary rocks (e.g., rock salt) form from precipitation."],"didYouKnow": ["Fossils are almost always found in sedimentary rock—igneous and metamorphic usually destroy them."],"relatedTopics": ["es-volcanoes","es-minerals","es-weathering"]},
  {"id": "es-minerals","subject": "Earth & Space Science","title": "Minerals","whatIsIt": "Minerals are naturally occurring, inorganic solids with a definite chemical composition and crystalline structure. Rocks are made of one or more minerals.","howItWorks": "Minerals are identified by properties: hardness (Mohs scale), streak (color of powdered mineral), luster, cleavage/fracture, and sometimes taste or reaction to acid. Common minerals include quartz, feldspar, calcite, mica, and pyrite.","realWorldExample": "Diamond and graphite are both pure carbon but different crystal structures—different minerals. Salt (halite) is a mineral.","keyTerms":[{"term": "Mineral","definition": "Naturally occurring, inorganic solid with definite composition and crystal structure."},{"term": "Mohs scale","definition": "Scale of mineral hardness from 1 (talc) to 10 (diamond)."},{"term": "Streak","definition": "Color of a mineral in powdered form; more reliable than surface color."}],"nsbTraps": ["Rocks are not minerals—rocks are aggregates of minerals. A few rocks are made of one mineral (e.g., limestone from calcite)."],"didYouKnow": ["There are over 5,000 known minerals, but only a few dozen are common in rocks."],"relatedTopics": ["es-rock-cycle","es-earths-layers"]},
  {"id": "es-weathering","subject": "Earth & Space Science","title": "Weathering & Erosion","whatIsIt": "Weathering breaks down rock in place (physical or chemical). Erosion is the transport of weathered material by water, wind, ice, or gravity.","howItWorks": "Physical weathering: frost wedging, root growth, abrasion—no chemical change. Chemical weathering: water, acid (e.g., from CO₂), oxygen break down minerals. Erosion moves the pieces. Deposition is when transported material is dropped.","realWorldExample": "Potholes form from frost wedging. Rust on rocks is chemical weathering. Rivers carry sediment to the ocean.","keyTerms":[{"term": "Physical weathering","definition": "Breakdown of rock by mechanical processes (freeze-thaw, roots, abrasion)."},{"term": "Chemical weathering","definition": "Breakdown of rock by chemical reactions (dissolution, oxidation)."},{"term": "Erosion","definition": "Transport of weathered material by water, wind, ice, or gravity."}],"nsbTraps": ["Weathering = in place; erosion = movement. Don't use them interchangeably."],"didYouKnow": ["The Grand Canyon was carved by the Colorado River—erosion over millions of years."],"relatedTopics": ["es-rock-cycle","es-soil","es-water-cycle"]},
  {"id": "es-soil","subject": "Earth & Space Science","title": "Soil Formation","whatIsIt": "Soil is a mixture of weathered rock, organic matter, water, and air. It forms slowly as rock weathers and organisms add organic material.","howItWorks": "Parent rock weathers; plants and organisms add humus. Soil has layers (horizons): O (organic), A (topsoil), B (subsoil), C (weathered parent rock). Factors: climate, parent material, organisms, topography, time.","realWorldExample": "Fertile farmland has thick, organic-rich topsoil. Desert soil may be thin and mineral-rich.","keyTerms":[{"term": "Humus","definition": "Decayed organic matter in soil; dark, nutrient-rich."},{"term": "Horizon","definition": "Layer of soil with distinct properties (O, A, B, C)."}],"nsbTraps": ["Soil is not just 'dirt'—it's a living system with bacteria, fungi, and invertebrates."],"didYouKnow": ["It can take hundreds to thousands of years to form a few centimeters of topsoil."],"relatedTopics": ["es-weathering","es-rock-cycle"]},
  {"id": "es-water-cycle","subject": "Earth & Space Science","title": "The Water Cycle","whatIsIt": "Water cycles through evaporation, condensation, precipitation, and runoff. The sun drives the cycle; water moves between ocean, atmosphere, land, and living things.","howItWorks": "Evaporation: liquid to vapor (from oceans, lakes, plants—transpiration). Condensation: vapor to liquid (clouds form). Precipitation: rain, snow, etc. Runoff and infiltration return water to bodies of water or groundwater. The total amount of water on Earth is essentially constant.","realWorldExample": "Ocean water evaporates; clouds form; rain falls on land; rivers carry water back to the ocean.","keyTerms":[{"term": "Evaporation","definition": "Liquid water becoming water vapor; driven by heat."},{"term": "Condensation","definition": "Water vapor becoming liquid; forms clouds and dew."},{"term": "Precipitation","definition": "Water falling from clouds as rain, snow, sleet, or hail."},{"term": "Transpiration","definition": "Water vapor released by plants through their leaves."}],"nsbTraps": ["The water cycle has no start or end—it's a continuous loop. Transpiration is a major source of atmospheric water."],"didYouKnow": ["The same water molecules have been cycling for billions of years—you might drink water a dinosaur drank."],"relatedTopics": ["es-weathering","es-oceans","es-weather"]},
  {"id": "es-oceans","subject": "Earth & Space Science","title": "Oceans","whatIsIt": "Oceans cover most of Earth and affect climate, weather, and life. They have currents, tides, and distinct zones. Salinity and temperature vary.","howItWorks": "Surface currents are driven by wind and the Coriolis effect; deep currents by density (temperature and salinity). Tides are caused mainly by the Moon's gravity (and the Sun's). The ocean floor has mid-ocean ridges, trenches, and abyssal plains.","realWorldExample": "The Gulf Stream carries warm water north along the East Coast. Tides rise and fall roughly twice a day.","keyTerms":[{"term": "Salinity","definition": "Salt content of water; oceans are about 3.5% salt."},{"term": "Current","definition": "Flow of water in the ocean; surface or deep."},{"term": "Tide","definition": "Rise and fall of sea level caused mainly by the Moon's gravity."}],"nsbTraps": ["Tides are not caused by the Moon 'pulling' water only—the whole Earth is pulled; the water bulges on both sides."],"didYouKnow": ["The ocean absorbs a lot of CO₂—which affects ocean acidity and marine life."],"relatedTopics": ["es-water-cycle","es-earths-layers","es-moon"]},
  {"id": "es-weather","subject": "Earth & Space Science","title": "Weather & Atmosphere","whatIsIt": "The atmosphere has layers (troposphere, stratosphere, mesosphere, thermosphere). Weather is the short-term state of the atmosphere; climate is long-term average.","howItWorks": "Troposphere: where we live; weather and clouds; temperature decreases with height. Stratosphere: contains ozone layer; temperature increases with height. Weather is driven by sun, water cycle, and air pressure differences.","realWorldExample": "Storms form in the troposphere. Planes often fly in the lower stratosphere. The ozone layer protects us from UV.","keyTerms":[{"term": "Troposphere","definition": "Lowest layer of atmosphere; where weather occurs; temp decreases with altitude."},{"term": "Stratosphere","definition": "Layer above troposphere; contains ozone; temp increases with altitude."},{"term": "Ozone layer","definition": "Region with high ozone (O₃) that absorbs UV radiation."}],"nsbTraps": ["Weather vs. climate: weather is day-to-day; climate is average over decades. One cold day doesn't disprove climate change."],"didYouKnow": ["Most of the atmosphere's mass is in the troposphere—the first 10–15 km."],"relatedTopics": ["es-water-cycle","es-weather-systems","es-climate"]},
  {"id": "es-weather-systems","subject": "Earth & Space Science","title": "Weather Systems","whatIsIt": "Weather is driven by air masses, fronts (boundaries between air masses), and pressure systems. High pressure usually means fair weather; low pressure often means clouds and precipitation.","howItWorks": "Cold fronts: cold air advances and lifts warm air—often storms. Warm fronts: warm air overrides cold—slower, broader precipitation. High pressure: sinking air, clear skies. Low pressure: rising air, clouds. Clouds form when air rises and cools (adiabatic cooling).","realWorldExample": "A cold front might bring thunderstorms. Hurricanes are intense low-pressure systems over warm ocean water.","keyTerms":[{"term": "Front","definition": "Boundary between two air masses of different temperature and humidity."},{"term": "High pressure","definition": "Area where air is sinking; generally fair weather."},{"term": "Low pressure","definition": "Area where air is rising; often clouds and precipitation."}],"nsbTraps": ["Cold front = cold air advancing. Warm front = warm air advancing. Don't confuse the direction of movement."],"didYouKnow": ["Weather maps show isobars (lines of equal pressure)—winds blow roughly parallel to them."],"relatedTopics": ["es-weather","es-climate"]},
  {"id": "es-climate","subject": "Earth & Space Science","title": "Climate & Climate Change","whatIsIt": "Climate is the long-term average of weather in a region. Climate change is a shift in those averages—currently driven largely by increased greenhouse gases from human activity.","howItWorks": "Greenhouse effect: certain gases (CO₂, methane, water vapor) trap heat in the atmosphere. More greenhouse gases mean more warming. Evidence: rising temperatures, melting ice, sea-level rise, more extreme events. Mitigation (reduce emissions) and adaptation (prepare for changes) are responses.","realWorldExample": "The last century has warmed; glaciers are retreating; sea level is rising. Burning fossil fuels adds CO₂.","keyTerms":[{"term": "Greenhouse effect","definition": "Trapping of heat by certain gases in the atmosphere; natural and enhanced by human activity."},{"term": "Climate change","definition": "Long-term shift in climate patterns; currently refers to human-caused global warming."}],"nsbTraps": ["Climate and weather are different. One record cold day doesn't disprove global warming—it's about long-term trends."],"didYouKnow": ["Earth's climate has changed before (ice ages), but current change is very fast and linked to CO₂ from fossil fuels."],"relatedTopics": ["es-weather","en-climate-energy"]},
  {"id": "es-solar-system","subject": "Earth & Space Science","title": "The Solar System","whatIsIt": "The solar system includes the Sun, eight planets, dwarf planets (e.g., Pluto), moons, asteroids, and comets. Planets orbit the Sun; moons orbit planets.","howItWorks": "Inner planets (Mercury, Venus, Earth, Mars) are rocky. Outer planets (Jupiter, Saturn, Uranus, Neptune) are gas giants (and ice). The asteroid belt is between Mars and Jupiter. The Kuiper belt and Oort cloud hold icy bodies. Orbits are elliptical (Kepler's laws).","realWorldExample": "We live on the third planet. Jupiter is the largest. Comets have long, elliptical orbits and develop tails near the Sun.","keyTerms":[{"term": "Planet","definition": "Body that orbits the Sun, is round, and has cleared its orbit (IAU definition)."},{"term": "Dwarf planet","definition": "Round body that orbits the Sun but has not cleared its orbit (e.g., Pluto)."},{"term": "Asteroid","definition": "Rocky body orbiting the Sun; most in the asteroid belt."}],"nsbTraps": ["Pluto is a dwarf planet, not a planet—not because it's small but because it hasn't cleared its orbit."],"didYouKnow": ["The solar system is about 4.6 billion years old."],"relatedTopics": ["es-sun","es-stars","es-moon"]},
  {"id": "es-sun","subject": "Earth & Space Science","title": "The Sun","whatIsIt": "The Sun is a star at the center of our solar system. It's powered by nuclear fusion in its core—hydrogen fusing into helium.","howItWorks": "Core: fusion (extremely high T and P). Radiative and convective zones carry energy outward. Photosphere is the visible surface. Chromosphere and corona are outer layers. Sunspots are cooler regions; solar flares and coronal mass ejections are eruptions.","realWorldExample": "Sunlight is energy from fusion that left the Sun about 8 minutes ago. Solar flares can affect satellites and power grids.","keyTerms":[{"term": "Nuclear fusion","definition": "Process in the Sun's core; hydrogen nuclei combine to form helium; releases energy."},{"term": "Sunspot","definition": "Cooler, darker region on the Sun's surface; related to magnetic activity."},{"term": "Solar flare","definition": "Sudden eruption of energy and particles from the Sun."}],"nsbTraps": ["The Sun is not on fire—it's fusion, not combustion. It's mostly hydrogen and helium."],"didYouKnow": ["The Sun will run out of core hydrogen in billions of years and become a red giant."],"relatedTopics": ["es-solar-system","es-stars","ps-nuclear"]},
  {"id": "es-stars","subject": "Earth & Space Science","title": "Stars & the Life Cycle of Stars","whatIsIt": "Stars are balls of gas that produce light and heat by fusion. They form from nebulae, spend most of their lives on the main sequence, and eventually die—outcome depends on mass.","howItWorks": "Formation: nebula collapses; protostar; fusion begins → main sequence. Low-mass stars: red giant → white dwarf. High-mass: red supergiant → supernova → neutron star or black hole. Main sequence is the stable phase (H → He in core).","realWorldExample": "The Sun is a main-sequence star. Betelgeuse is a red supergiant. The Crab Nebula is a supernova remnant.","keyTerms":[{"term": "Main sequence","definition": "Phase where a star fuses hydrogen in its core; most of a star's life."},{"term": "Red giant","definition": "Phase when a star expands after core hydrogen is used; cooler surface, larger size."},{"term": "Supernova","definition": "Explosive death of a massive star; can outshine a galaxy briefly."},{"term": "White dwarf","definition": "Dense remnant of a low-mass star after red giant phase."}],"nsbTraps": ["Not all stars become black holes—only the most massive. Sun-like stars become white dwarfs."],"didYouKnow": ["We are made of 'star stuff'—elements heavier than hydrogen and helium were made in stars and supernovae."],"relatedTopics": ["es-sun","es-galaxies"]},
  {"id": "es-galaxies","subject": "Earth & Space Science","title": "Galaxies & the Universe","whatIsIt": "Galaxies are huge collections of stars, gas, and dust. The Milky Way is our galaxy. The universe is expanding; the Big Bang is the leading theory for its origin.","howItWorks": "Galaxy types: spiral (like Milky Way), elliptical, irregular. The universe began about 13.8 billion years ago in a hot, dense state and has been expanding since. Redshift of distant galaxies shows they're moving away. Cosmic microwave background is leftover radiation from the early universe.","realWorldExample": "The Andromeda Galaxy is a spiral like ours. The universe is getting bigger; distant galaxies recede faster.","keyTerms":[{"term": "Galaxy","definition": "Large system of stars, gas, dust, and dark matter bound by gravity."},{"term": "Milky Way","definition": "Our galaxy; a spiral galaxy containing the solar system."},{"term": "Big Bang","definition": "Theory that the universe began in a hot, dense state and has been expanding since."}],"nsbTraps": ["The Big Bang was not an explosion in space—it was the expansion of space itself."],"didYouKnow": ["There are billions of galaxies, each with billions of stars."],"relatedTopics": ["es-stars","es-solar-system"]},
  {"id": "es-moon","subject": "Earth & Space Science","title": "Earth's Moon","whatIsIt": "The Moon is Earth's only natural satellite. It has phases (due to the relative positions of Sun, Earth, Moon), causes tides, and can eclipse the Sun or be eclipsed by Earth.","howItWorks": "Phases: new, waxing crescent, first quarter, waxing gibbous, full, waning gibbous, last quarter, waning crescent—cycle about 29.5 days. Lunar eclipse: Earth's shadow on the Moon (full moon). Solar eclipse: Moon blocks Sun (new moon). The Moon is tidally locked—same side faces Earth.","realWorldExample": "We see different amounts of the lit half of the Moon each night. Eclipses don't happen every month because the Moon's orbit is tilted.","keyTerms":[{"term": "Lunar phase","definition": "Appearance of the Moon as seen from Earth (new, quarter, full, etc.)."},{"term": "Lunar eclipse","definition": "Earth blocks sunlight from reaching the Moon; happens at full moon."},{"term": "Solar eclipse","definition": "Moon blocks sunlight from reaching Earth; happens at new moon."}],"nsbTraps": ["Moon phases are not caused by Earth's shadow—that's an eclipse. Phases are due to how much of the sunlit side we see."],"didYouKnow": ["The Moon is slowly moving away from Earth (a few cm per year)."],"relatedTopics": ["es-oceans","es-solar-system","es-time-seasons"]},
  {"id": "es-space-exploration","subject": "Earth & Space Science","title": "Space Exploration & Technology","whatIsIt": "Spacecraft, telescopes, and satellites help us explore and use space. Robotic missions have visited planets and moons; humans have been to the Moon and live on the ISS.","howItWorks": "Rockets use Newton's third law (expel mass backward to go forward). Orbit requires sufficient horizontal speed so the object 'falls around' Earth. Telescopes (optical, radio, space-based) collect light and other radiation. Satellites are used for communication, weather, GPS, and science.","realWorldExample": "Mars rovers send back images and data. The Hubble and James Webb telescopes observe distant objects. GPS relies on satellites.","keyTerms":[{"term": "Orbit","definition": "Path of an object around another due to gravity; balance of forward motion and fall."},{"term": "Satellite","definition": "Object that orbits a planet; natural (e.g., Moon) or artificial (e.g., ISS)."}],"nsbTraps": ["Astronauts in orbit are not 'weightless' because there's no gravity—they're in free fall (microgravity)."],"didYouKnow": ["The International Space Station orbits about 400 km above Earth and circles it roughly every 90 minutes."],"relatedTopics": ["es-solar-system","ps-newtons-laws"]},
  {"id": "es-time-seasons","subject": "Earth & Space Science","title": "Time, Seasons & Earth's Rotation/Revolution","whatIsIt": "Earth rotates on its axis once per day (causing day and night). Earth revolves around the Sun once per year. The tilt of Earth's axis (about 23.5°) causes seasons.","howItWorks": "Rotation: 24 hours; day and night. Revolution: 365.25 days; one year. The axis is tilted relative to the orbit—so when one hemisphere is tilted toward the Sun, it gets more direct sunlight and longer days (summer); the other has winter. Equinoxes: equal day/night. Solstices: longest/shortest day.","realWorldExample": "When it's summer in the Northern Hemisphere, it's winter in the Southern—opposite tilts toward the Sun.","keyTerms":[{"term": "Rotation","definition": "Spinning of Earth on its axis; causes day and night."},{"term": "Revolution","definition": "Orbit of Earth around the Sun; causes the year and seasons (with tilt)."},{"term": "Solstice","definition": "When the Sun is at its highest or lowest in the sky; longest or shortest day."},{"term": "Equinox","definition": "When day and night are equal length; Sun overhead at equator."}],"nsbTraps": ["Seasons are not caused by how close Earth is to the Sun—we're actually closer in January. Tilt is the key."],"didYouKnow": ["The tilt is why we have different climate zones and the midnight sun in polar summer."],"relatedTopics": ["es-moon","es-solar-system"]},
  {"id": "en-fossil","subject": "Energy","title": "Fossil Fuels","whatIsIt": "Fossil fuels (coal, oil, natural gas) formed from ancient organic matter over millions of years. They store chemical energy and release it when burned.","howItWorks": "Formation: dead organisms were buried and subjected to heat and pressure; organic matter became hydrocarbon-rich. Coal from plants; oil and natural gas from marine organisms. Burning (combustion) releases CO₂ and water plus heat. Pros: abundant, high energy density. Cons: nonrenewable, pollution, greenhouse gases.","realWorldExample": "Gasoline in cars, coal in power plants, natural gas for heating and cooking.","keyTerms":[{"term": "Coal","definition": "Solid fossil fuel; formed from plant matter; used for electricity."},{"term": "Natural gas","definition": "Mostly methane; fossil fuel; burns cleaner than coal or oil."},{"term": "Nonrenewable","definition": "Resource that cannot be replaced in a human timescale."}],"nsbTraps": ["Fossil fuels are not literally fossils—they're from ancient organic matter. Oil and gas are not 'dinosaurs'—mostly from plankton and plants."],"didYouKnow": ["The U.S. and other countries are shifting to cleaner energy to reduce CO₂ emissions."],"relatedTopics": ["en-forms","en-nuclear","en-climate-energy"]},
  {"id": "en-nuclear","subject": "Energy","title": "Nuclear Energy","whatIsIt": "Nuclear power plants use fission—splitting uranium nuclei—to heat water, make steam, and turn turbines to generate electricity. No CO₂ from the reaction, but there is radioactive waste.","howItWorks": "Uranium-235 nuclei absorb neutrons and split; release more neutrons and energy. Chain reaction: neutrons cause more fissions. Control rods absorb neutrons to regulate. Heat from the reactor turns water to steam; steam drives a turbine connected to a generator.","realWorldExample": "About 20% of U.S. electricity is from nuclear. France gets most of its electricity from nuclear.","keyTerms":[{"term": "Fission","definition": "Splitting of a heavy nucleus; releases energy and neutrons."},{"term": "Chain reaction","definition": "When one fission causes more fissions; controlled in a reactor."},{"term": "Control rod","definition": "Material that absorbs neutrons; inserted/removed to control the reaction."}],"nsbTraps": ["Nuclear power does not produce greenhouse gases from the reaction—but mining and building plants have other impacts. Waste stays radioactive for a long time."],"didYouKnow": ["Nuclear fusion (like in the Sun) is being researched for future power—it would produce less long-lived waste."],"relatedTopics": ["ps-nuclear","en-forms","en-fossil"]},
  {"id": "en-solar","subject": "Energy","title": "Solar Energy","whatIsIt": "Solar energy comes from the Sun. We capture it with photovoltaic (PV) cells (electricity) or solar thermal systems (heat). It's renewable and produces no direct emissions.","howItWorks": "PV cells: sunlight knocks electrons loose in a semiconductor (e.g., silicon), creating electric current. Solar thermal: mirrors or collectors focus sunlight to heat a fluid, which can drive a turbine or provide hot water. Efficiency and output depend on location, angle, and weather.","realWorldExample": "Rooftop solar panels on homes. Large solar farms in sunny regions. Solar water heaters.","keyTerms":[{"term": "Photovoltaic (PV)","definition": "Converting light directly into electricity using semiconductor cells."},{"term": "Solar thermal","definition": "Using sunlight to heat a fluid; can generate electricity or provide heat."},{"term": "Renewable","definition": "Energy source that can be replenished in a human timescale (e.g., sun, wind)."}],"nsbTraps": ["Solar doesn't work at night and is reduced on cloudy days—storage or backup is needed for 24/7 power."],"didYouKnow": ["The amount of sunlight that hits Earth in an hour could meet global energy needs for a year—if we could capture and store it."],"relatedTopics": ["en-forms","en-wind","es-sun"]},
  {"id": "en-wind","subject": "Energy","title": "Wind Energy","whatIsIt": "Wind turbines convert the kinetic energy of moving air into electricity. Wind is caused by uneven heating of the Earth (sun). It's renewable and produces no direct emissions.","howItWorks": "Wind turns the blades of a turbine; the rotor is connected to a generator that produces electricity. Larger and taller turbines capture more wind. Wind farms are often in windy areas (plains, coasts, offshore). Variable—wind doesn't blow constantly.","realWorldExample": "Wind farms in Texas, Iowa, and offshore in Europe. Single turbines for homes or farms.","keyTerms":[{"term": "Turbine","definition": "Device with blades that turn when fluid (wind, water, steam) flows through; drives a generator."},{"term": "Rotor","definition": "The rotating part of a wind turbine (the blades and hub)."}],"nsbTraps": ["Wind energy is indirect solar—sun heats Earth unevenly, causing wind. Not 'new' energy, just converted."],"didYouKnow": ["Offshore wind is often stronger and more consistent than on land."],"relatedTopics": ["en-solar","en-hydro","en-forms"]},
  {"id": "en-hydro","subject": "Energy","title": "Hydroelectric Power","whatIsIt": "Hydroelectric power uses the energy of falling or flowing water to turn turbines and generate electricity. Dams store water and create height (potential energy) that becomes kinetic energy and then electricity.","howItWorks": "Water behind a dam has gravitational potential energy. It flows through penstocks to turbines; the water's motion spins the turbines, which drive generators. Output depends on flow rate and height (head). Pumped storage: use excess electricity to pump water uphill; release it to generate when needed.","realWorldExample": "Hoover Dam, Three Gorges Dam. Many countries get a large share of electricity from hydropower.","keyTerms":[{"term": "Head","definition": "Height of water above the turbine; more head means more potential energy."},{"term": "Penstock","definition": "Pipe that carries water from the reservoir to the turbine."}],"nsbTraps": ["Hydropower is renewable but dams can affect ecosystems and displace people—not without impacts."],"didYouKnow": ["Hydropower is one of the oldest and largest sources of renewable electricity worldwide."],"relatedTopics": ["en-wind","en-forms","es-water-cycle"]},
  {"id": "en-geothermal","subject": "Energy","title": "Geothermal Energy","whatIsIt": "Geothermal energy is heat from inside Earth. We use it for electricity (where hot rock or magma is close to the surface) or for heating and cooling (ground-source heat pumps).","howItWorks": "In volcanic regions, hot water or steam from underground can drive turbines. In other places, heat pumps use the stable temperature of the ground a few meters down—cool in summer, warm in winter—to heat or cool buildings efficiently.","realWorldExample": "Iceland gets much of its electricity and heat from geothermal. Heat pumps in homes use the ground as a heat source/sink.","keyTerms":[{"term": "Geothermal","definition": "Relating to heat from Earth's interior."},{"term": "Heat pump","definition": "Device that moves heat from one place to another; can heat or cool efficiently."}],"nsbTraps": ["Geothermal for electricity is limited to geologically active areas; heat pumps work almost anywhere."],"didYouKnow": ["The core of Earth is as hot as the surface of the Sun—that heat slowly flows outward."],"relatedTopics": ["en-forms","es-earths-layers"]},
  {"id": "en-biomass","subject": "Energy","title": "Biomass & Biofuels","whatIsIt": "Biomass is organic material (plants, animal waste) used for energy. Biofuels (e.g., ethanol, biodiesel) are fuels made from biomass. They can be renewable if the source is regrown.","howItWorks": "Burning biomass releases stored chemical energy (like fossil fuels but from recent carbon). Ethanol is made by fermenting sugars (e.g., from corn). Biodiesel from vegetable oils or animal fats. Biogas from decomposition of waste. Carbon-neutral only if the CO₂ released is balanced by new growth.","realWorldExample": "Ethanol in gasoline. Wood pellets for heating. Landfill gas for electricity.","keyTerms":[{"term": "Biomass","definition": "Organic material from plants or animals used as an energy source."},{"term": "Biofuel","definition": "Fuel (e.g., ethanol, biodiesel) made from biomass."}],"nsbTraps": ["Biofuels are not automatically carbon-neutral—growing, processing, and transport use energy and land."],"didYouKnow": ["Some airplanes are testing biofuels made from used cooking oil or algae."],"relatedTopics": ["en-forms","en-fossil"]},
  {"id": "en-efficiency","subject": "Energy","title": "Energy Efficiency & Conservation","whatIsIt": "Efficiency means using less energy to do the same task (e.g., LED vs incandescent). Conservation means using less energy overall (turning off lights, insulation). Both reduce demand and environmental impact.","howItWorks": "Efficiency: better technology (motors, appliances, vehicles) converts more input energy to useful output; the rest is waste heat. Conservation: behavior and design (thermostats, insulation, less driving). Efficiency = useful output ÷ energy input.","realWorldExample": "LED bulbs use much less electricity than incandescent for the same light. Insulation keeps heat in during winter.","keyTerms":[{"term": "Efficiency","definition": "Ratio of useful energy output to energy input; higher is better."},{"term": "Conservation","definition": "Using less energy through behavior or design."}],"nsbTraps": ["Efficiency doesn't mean using zero energy—it means less waste. A 90% efficient heater still loses 10%."],"didYouKnow": ["The U.S. DOE promotes energy efficiency—it's often the cheapest way to 'create' more energy (by saving it)."],"relatedTopics": ["en-conservation","en-grid"]},
  {"id": "en-grid","subject": "Energy","title": "The Electric Grid","whatIsIt": "The electric grid is the network that delivers electricity from power plants to homes and businesses. It includes transmission (high voltage, long distance) and distribution (lower voltage, local).","howItWorks": "Power plants generate AC electricity. Step-up transformers increase voltage for transmission (less loss over distance). Transmission lines carry power. Substations step voltage down. Distribution lines bring power to neighborhoods. Transformers at poles or pads step it down again for homes (e.g., 120 V).","realWorldExample": "When you flip a switch, electricity flows from a power plant (maybe hundreds of miles away) through the grid to your outlet.","keyTerms":[{"term": "Transmission","definition": "Moving electricity at high voltage over long distances."},{"term": "Distribution","definition": "Delivering electricity at lower voltage to customers."},{"term": "Transformer","definition": "Device that increases or decreases AC voltage."}],"nsbTraps": ["AC is used for transmission because voltage can be easily changed with transformers—reducing current and losses."],"didYouKnow": ["The U.S. grid has three main regions (Eastern, Western, Texas) that don't fully connect."],"relatedTopics": ["ps-electricity","en-efficiency"]},
  {"id": "en-doe-policy","subject": "Energy","title": "DOE & U.S. Energy Policy Basics","whatIsIt": "The U.S. Department of Energy (DOE) oversees energy research, nuclear security, and energy policy. U.S. energy policy affects what sources we use, efficiency standards, and climate goals.","howItWorks": "DOE funds research on renewables, nuclear, fusion, and efficiency. It manages the nuclear weapons complex and cleanup. Policy (laws, regulations, incentives) can promote certain fuels, set vehicle efficiency standards, or support clean energy. The National Science Bowl is run by DOE.","realWorldExample": "DOE research helped improve solar cells and batteries. Tax credits for electric vehicles are a policy tool.","keyTerms":[{"term": "DOE","definition": "U.S. Department of Energy; oversees energy research and nuclear security."},{"term": "Energy policy","definition": "Laws, regulations, and incentives that shape energy use and supply."}],"nsbTraps": ["DOE is not the same as EPA (environmental) or FERC (electricity markets)—each has a different role."],"didYouKnow": ["The National Science Bowl is a DOE program to encourage students in science and math."],"relatedTopics": ["en-grid","en-efficiency"]},
  {"id": "en-climate-energy","subject": "Energy","title": "Climate Change & Energy","whatIsIt": "Burning fossil fuels is the main source of human-caused greenhouse gas emissions. Shifting to clean energy and using less energy can slow climate change.","howItWorks": "CO₂ from burning coal, oil, and gas traps heat (greenhouse effect). To limit warming, we need to cut emissions: use renewables, nuclear, efficiency, and conservation. Carbon capture can reduce emissions from fossil plants. Adaptation (e.g., resilient grid) is also needed.","realWorldExample": "Replacing coal plants with wind and solar reduces CO₂. Electric vehicles and heat pumps reduce fossil use.","keyTerms":[{"term": "Greenhouse gas","definition": "Gas that traps heat in the atmosphere (CO₂, methane, etc.)."},{"term": "Decarbonization","definition": "Reducing or eliminating CO₂ emissions from energy and industry."}],"nsbTraps": ["Climate change is about long-term buildup of CO₂—one clean power plant helps but global action is needed."],"didYouKnow": ["Many countries have pledged to reach net-zero emissions by mid-century to limit warming."],"relatedTopics": ["es-climate","en-fossil","en-solar"]},
  {"id": "math-number-theory","subject": "Math","title": "Number Theory","whatIsIt": "Number theory studies integers: primes, factors, multiples, GCF (greatest common factor), and LCM (least common multiple).","howItWorks": "A prime has exactly two factors (1 and itself). Factors divide evenly; multiples are the product with an integer. GCF: largest number that divides two or more numbers. LCM: smallest number that is a multiple of two or more numbers. Prime factorization (breaking into primes) helps find GCF and LCM.","realWorldExample": "Simplifying fractions uses GCF. Adding fractions with different denominators uses LCM.","keyTerms":[{"term": "Prime number","definition": "Integer greater than 1 with only two factors: 1 and itself."},{"term": "GCF","definition": "Greatest common factor; largest number that divides two or more numbers."},{"term": "LCM","definition": "Least common multiple; smallest number that is a multiple of two or more numbers."}],"nsbTraps": ["1 is not prime (only one factor). To find LCM, you need the highest power of each prime that appears."],"didYouKnow": ["There are infinitely many primes—Euclid proved it over 2,000 years ago."],"relatedTopics": ["math-pemdas","math-fractions"]},
  {"id": "math-fractions","subject": "Math","title": "Fractions, Decimals & Percentages","whatIsIt": "Fractions (a/b), decimals (e.g., 0.75), and percentages (e.g., 75%) are different ways to represent parts of a whole or ratios. They are equivalent and can be converted.","howItWorks": "Fraction to decimal: divide numerator by denominator. Decimal to percent: multiply by 100. Percent to fraction: put over 100 and simplify. To add/subtract fractions, use a common denominator. To multiply fractions, multiply numerators and denominators. To divide, multiply by the reciprocal.","realWorldExample": "Half = 1/2 = 0.5 = 50%. A 25% discount means you pay 75% of the price.","keyTerms":[{"term": "Numerator","definition": "Top number in a fraction; number of parts."},{"term": "Denominator","definition": "Bottom number in a fraction; total parts."},{"term": "Reciprocal","definition": "Flip of a fraction; a/b and b/a are reciprocals (product = 1)."}],"nsbTraps": ["When adding fractions, don't add denominators—find a common denominator first. Percent change is (new - old)/old × 100."],"didYouKnow": ["Repeating decimals (e.g., 0.333...) can be written as fractions (1/3)."],"relatedTopics": ["math-number-theory","math-ratios"]},
  {"id": "math-ratios","subject": "Math","title": "Ratios & Proportions","whatIsIt": "A ratio compares two quantities (e.g., 3:2 or 3/2). A proportion is an equation that two ratios are equal (e.g., a/b = c/d). Cross-multiply to solve.","howItWorks": "Ratios can be simplified like fractions. In a proportion a/b = c/d, ad = bc (cross-multiplication). Use proportions for scale drawings, unit rates, and similar figures. Unit rate = amount per one unit (e.g., miles per gallon).","realWorldExample": "If 2 apples cost $1, then 6 apples cost $3 (proportion). A map scale 1 inch = 10 miles is a ratio.","keyTerms":[{"term": "Ratio","definition": "Comparison of two quantities; can be written a:b or a/b."},{"term": "Proportion","definition": "Equation stating that two ratios are equal."},{"term": "Unit rate","definition": "Rate per one unit (e.g., dollars per pound)."}],"nsbTraps": ["Keep units consistent in a ratio. In a/b = c/d, cross-multiply gives ad = bc, not ac = bd."],"didYouKnow": ["The golden ratio (about 1.618) appears in art, nature, and architecture."],"relatedTopics": ["math-fractions","math-linear-eq"]},
  {"id": "math-exponents","subject": "Math","title": "Exponents & Scientific Notation","whatIsIt": "Exponents show repeated multiplication: aⁿ = a × a × … × a (n times). Scientific notation writes numbers as a × 10ⁿ where 1 ≤ a < 10; used for very large or small numbers.","howItWorks": "Rules: aᵐ·aⁿ = aᵐ⁺ⁿ; aᵐ/aⁿ = aᵐ⁻ⁿ; (aᵐ)ⁿ = aᵐⁿ; a⁰ = 1 (a ≠ 0); a⁻ⁿ = 1/aⁿ. Scientific notation: 3,000 = 3×10³; 0.004 = 4×10⁻³. Multiply: multiply the numbers and add exponents of 10.","realWorldExample": "2³ = 8. Speed of light ≈ 3×10⁸ m/s. Mass of an electron ≈ 9×10⁻³¹ kg.","keyTerms":[{"term": "Exponent","definition": "Number that shows how many times the base is used as a factor."},{"term": "Scientific notation","definition": "Number written as a × 10ⁿ where 1 ≤ a < 10; n is an integer."},{"term": "Base","definition": "Number that is multiplied by itself (e.g., in 2³, 2 is the base)."}],"nsbTraps": ["(2³)² = 2⁶ (multiply exponents), not 2⁵. 2³ + 2² is not 2⁵—no rule for adding same base."],"didYouKnow": ["Powers of 2 grow fast: 2¹⁰ = 1024 (about a thousand); 2²⁰ is about a million."],"relatedTopics": ["math-pemdas","math-roots"]},
  {"id": "math-roots","subject": "Math","title": "Square Roots & Cube Roots","whatIsIt": "The square root of a number n is a number that when squared equals n (√n = r means r² = n). The cube root is the number that when cubed equals n.","howItWorks": "√(a²) = |a|. √(ab) = √a·√b. √(a/b) = √a/√b. No negative under a square root in the reals. Cube roots can be negative (∛(-8) = -2). Perfect squares: 1, 4, 9, 16, 25, … Perfect cubes: 1, 8, 27, …","realWorldExample": "Area of square = side², so side = √area. Volume of cube = side³, so side = ∛volume.","keyTerms":[{"term": "Square root","definition": "Number r such that r² = n; written √n."},{"term": "Cube root","definition": "Number r such that r³ = n; written ∛n."},{"term": "Perfect square","definition": "Number that is the square of an integer (e.g., 9 = 3²)."}],"nsbTraps": ["√(a² + b²) is not a + b. √9 = 3, not ±3, when we mean the principal (nonnegative) root."],"didYouKnow": ["√2 is irrational—it cannot be written as a fraction of integers."],"relatedTopics": ["math-exponents","math-pythagorean"]},
  {"id": "math-algebra-expressions","subject": "Math","title": "Algebraic Expressions & Equations","whatIsIt": "An expression has numbers, variables, and operations (e.g., 3x + 2). An equation has an equals sign and can be solved for the variable.","howItWorks": "Combine like terms (same variable and exponent). Use distributive property: a(b + c) = ab + ac. To solve an equation, do the same operation to both sides to isolate the variable. Check by substituting the solution back.","realWorldExample": "If tickets cost $5 each plus $2 fee, total = 5n + 2. Solving 5n + 2 = 17 gives n = 3 tickets.","keyTerms":[{"term": "Variable","definition": "Letter representing an unknown or changing quantity."},{"term": "Like terms","definition": "Terms with the same variable(s) and exponent(s); can be combined."},{"term": "Distributive property","definition": "a(b + c) = ab + ac; multiply each term inside by the factor outside."}],"nsbTraps": ["2x and x² are not like terms. When you multiply (x+2)(x+3), use distributive property (FOIL or area model)."],"didYouKnow": ["Algebra lets you solve problems without guessing—write an equation and solve."],"relatedTopics": ["math-pemdas","math-linear-eq"]},
  {"id": "math-linear-eq","subject": "Math","title": "Linear Equations & Inequalities","whatIsIt": "A linear equation has variables to the first power (e.g., 2x + 3 = 7). Linear inequalities use <, >, ≤, ≥; solution is often a range.","howItWorks": "Solve linear equations: isolate the variable using inverse operations (add, subtract, multiply, divide both sides). Inequalities: same steps, but if you multiply or divide by a negative, flip the inequality sign. Graph linear equations as lines; inequalities as half-planes.","realWorldExample": "2x + 1 = 9 → x = 4. 'Score at least 70' → s ≥ 70.","keyTerms":[{"term": "Linear equation","definition": "Equation whose graph is a straight line; form ax + b = c or y = mx + b."},{"term": "Inequality","definition": "Statement using <, >, ≤, or ≥; solution is a set of values."},{"term": "Inverse operation","definition": "Operation that undoes another (e.g., add and subtract)."}],"nsbTraps": ["When multiplying or dividing an inequality by a negative number, reverse the inequality sign."],"didYouKnow": ["Linear equations have at most one solution; inequalities have infinitely many (a range)."],"relatedTopics": ["math-algebra-expressions","math-systems"]},
  {"id": "math-systems","subject": "Math","title": "Systems of Equations","whatIsIt": "A system is two or more equations with the same variables. A solution satisfies all equations at once. For two linear equations in two unknowns, solution is where the lines intersect.","howItWorks": "Methods: substitution (solve one equation for one variable, substitute into the other) or elimination (add/subtract equations to eliminate a variable). Number of solutions: one (lines cross), none (parallel), or infinitely many (same line).","realWorldExample": "Two items total $10; one costs $3 more than the other—two equations, two unknowns.","keyTerms":[{"term": "System of equations","definition": "Set of equations with the same variables; solution satisfies all."},{"term": "Substitution","definition": "Solving for one variable and plugging into another equation."},{"term": "Elimination","definition": "Adding or subtracting equations to cancel a variable."}],"nsbTraps": ["Check your solution in both equations. Parallel lines mean no solution (inconsistent)."],"didYouKnow": ["Systems show up in supply and demand, mixture problems, and many real-world models."],"relatedTopics": ["math-linear-eq","math-functions"]},
  {"id": "math-functions","subject": "Math","title": "Functions & Graphing","whatIsIt": "A function assigns exactly one output to each input. It can be given by a rule (e.g., f(x) = 2x + 1), a table, or a graph. The graph of y = f(x) shows all (input, output) pairs.","howItWorks": "Linear function: y = mx + b; m is slope, b is y-intercept. Slope = rise/run = (y₂ - y₁)/(x₂ - x₁). Graph by plotting points or using slope and intercept. Domain = possible inputs; range = possible outputs. Vertical line test: a graph is a function if no vertical line hits it more than once.","realWorldExample": "Distance = rate × time is a linear function of time. A graph of speed vs. time shows how speed changes.","keyTerms":[{"term": "Function","definition": "Rule that assigns exactly one output to each input."},{"term": "Slope","definition": "Rate of change; rise over run; m in y = mx + b."},{"term": "y-intercept","definition": "Where the graph crosses the y-axis; value of y when x = 0; b in y = mx + b."}],"nsbTraps": ["Slope is change in y over change in x, not the other way around. Vertical lines have undefined slope."],"didYouKnow": ["Not every equation in x and y is a function—e.g., x² + y² = 1 (circle) fails the vertical line test."],"relatedTopics": ["math-linear-eq","math-coordinate"]},
  {"id": "math-geom-angles","subject": "Math","title": "Geometry: Angles, Lines & Triangles","whatIsIt": "Angles are measured in degrees. Lines can be parallel (never meet) or perpendicular (right angle). Triangles have three angles that sum to 180°; types by sides (scalene, isosceles, equilateral) or angles (acute, right, obtuse).","howItWorks": "Complementary angles sum to 90°; supplementary to 180°. Vertical angles are equal. Parallel lines cut by a transversal give equal corresponding and alternate interior angles. Triangle sum: angle sum = 180°.","realWorldExample": "A ladder against a wall forms a right triangle. Parallel railroad tracks and a crossing create congruent angles.","keyTerms":[{"term": "Complementary angles","definition": "Two angles whose sum is 90°."},{"term": "Supplementary angles","definition": "Two angles whose sum is 180°."},{"term": "Vertical angles","definition": "Angles opposite each other when two lines cross; they are equal."}],"nsbTraps": ["In a triangle, the largest angle is opposite the longest side. Don't assume 'vertical' means 90°—vertical angles are across from each other."],"didYouKnow": ["The angles of any triangle add up to exactly 180°—true for every triangle."],"relatedTopics": ["math-pythagorean","math-geom-polygons"]},
  {"id": "math-geom-polygons","subject": "Math","title": "Geometry: Polygons & Area","whatIsIt": "A polygon is a closed figure with straight sides. Area is the amount of space inside. Formulas: rectangle A = lw, triangle A = ½bh, parallelogram A = bh, trapezoid A = ½(b₁ + b₂)h.","howItWorks": "Count sides for names: triangle (3), quadrilateral (4), pentagon (5), hexagon (6). Sum of interior angles of an n-gon = (n - 2)×180°. Area formulas depend on shape; height is perpendicular to the base.","realWorldExample": "Floor area = length × width. A triangular banner has area ½ × base × height.","keyTerms":[{"term": "Polygon","definition": "Closed figure with straight sides."},{"term": "Area","definition": "Measure of the region inside a 2D figure; in square units."},{"term": "Parallelogram","definition": "Quadrilateral with two pairs of parallel sides; A = base × height."}],"nsbTraps": ["In a triangle, the 'height' must be perpendicular to the base—the side is not always the height."],"didYouKnow": ["A square is a rectangle and a rhombus; a rectangle is a parallelogram."],"relatedTopics": ["math-geom-angles","math-geom-circles"]},
  {"id": "math-geom-circles","subject": "Math","title": "Geometry: Circles","whatIsIt": "A circle is all points equidistant from the center. Radius r is that distance; diameter d = 2r. Circumference C = 2πr = πd. Area A = πr².","howItWorks": "Circumference is the perimeter of the circle. Area is π times radius squared (not diameter). An arc is part of the circumference; central angle (in degrees) gives arc length = (angle/360)×2πr. Sector area = (angle/360)×πr².","realWorldExample": "Tire circumference determines how far the car goes per rotation. Pizza area = πr².","keyTerms":[{"term": "Radius","definition": "Distance from center of circle to any point on the circle."},{"term": "Circumference","definition": "Perimeter of a circle; C = 2πr = πd."},{"term": "Diameter","definition": "Distance across the circle through the center; d = 2r."}],"nsbTraps": ["Area is πr²—if you're given diameter, use r = d/2 first. π is about 3.14 (or use the π key)."],"didYouKnow": ["π is irrational—its decimal never repeats and never ends."],"relatedTopics": ["math-geom-polygons","math-geom-3d"]},
  {"id": "math-geom-3d","subject": "Math","title": "Geometry: 3D Shapes","whatIsIt": "Three-dimensional shapes have volume (space inside) and surface area (total area of all faces). Common shapes: prism, pyramid, cylinder, cone, sphere.","howItWorks": "Prism (including cube, rectangular box): volume = base area × height; surface area = sum of areas of all faces. Cylinder: V = πr²h; SA = 2πr² + 2πrh. Sphere: V = (4/3)πr³; SA = 4πr². Cone: V = (1/3)πr²h.","realWorldExample": "Volume of a box = length × width × height. Volume of a can = πr²h.","keyTerms":[{"term": "Volume","definition": "Amount of space inside a 3D shape; in cubic units."},{"term": "Surface area","definition": "Total area of all faces (or curved surface) of a 3D shape."},{"term": "Prism","definition": "3D shape with two parallel congruent bases and rectangular lateral faces."}],"nsbTraps": ["Cube has 6 faces; surface area = 6s². Don't confuse volume (cubic units) with surface area (square units)."],"didYouKnow": ["A sphere has the most volume for a given surface area—so bubbles are round."],"relatedTopics": ["math-geom-circles","math-geom-polygons"]},
  {"id": "math-pythagorean","subject": "Math","title": "The Pythagorean Theorem","whatIsIt": "In a right triangle, the square of the hypotenuse equals the sum of the squares of the legs: a² + b² = c², where c is the hypotenuse (side opposite the right angle).","howItWorks": "Only works for right triangles. Identify the hypotenuse (longest side, opposite the right angle). Substitute the two legs and hypotenuse into a² + b² = c². Solve for the unknown. To find a leg: a² = c² - b².","realWorldExample": "A 3-4-5 triangle is right (3² + 4² = 9 + 16 = 25 = 5²). Ladder against a wall: ladder length is hypotenuse.","keyTerms":[{"term": "Hypotenuse","definition": "Longest side of a right triangle; opposite the right angle."},{"term": "Leg","definition": "Either of the two sides of a right triangle that form the right angle."},{"term": "Pythagorean theorem","definition": "In a right triangle, a² + b² = c² where c is the hypotenuse."}],"nsbTraps": ["The hypotenuse must be c—the side opposite the right angle. If you get a² + b² < c², you might have swapped."],"didYouKnow": ["There are infinitely many Pythagorean triples (integer sides), e.g., 5-12-13, 8-15-17."],"relatedTopics": ["math-geom-angles","math-roots","math-coordinate"]},
  {"id": "math-coordinate","subject": "Math","title": "Coordinate Geometry","whatIsIt": "The coordinate plane has x- and y-axes. Points are (x, y). Distance between two points: use Pythagorean theorem. Midpoint: average of x-coordinates, average of y-coordinates.","howItWorks": "Distance: d = √[(x₂ - x₁)² + (y₂ - y₁)²]. Midpoint: M = ((x₁ + x₂)/2, (y₁ + y₂)/2). Slope m = (y₂ - y₁)/(x₂ - x₁). Lines: y = mx + b (slope-intercept); parallel lines have same slope; perpendicular slopes multiply to -1.","realWorldExample": "Map coordinates; distance between two cities; midpoint of a segment.","keyTerms":[{"term": "Coordinate plane","definition": "Plane with x-axis (horizontal) and y-axis (vertical); points (x, y)."},{"term": "Midpoint","definition": "Point halfway between two points; average of coordinates."},{"term": "Distance formula","definition": "d = √[(x₂ - x₁)² + (y₂ - y₁)²]; from Pythagorean theorem."}],"nsbTraps": ["Order doesn't matter in distance formula (squared), but slope is (y₂ - y₁)/(x₂ - x₁)—keep order consistent."],"didYouKnow": ["The coordinate plane is also called the Cartesian plane after René Descartes."],"relatedTopics": ["math-pythagorean","math-functions"]},
  {"id": "math-probability","subject": "Math","title": "Probability & Combinatorics","whatIsIt": "Probability is the chance of an event: P(event) = number of favorable outcomes / total outcomes (when equally likely). Combinatorics counts arrangements: permutations (order matters) and combinations (order doesn't).","howItWorks": "Probability between 0 and 1 (or 0% and 100%). P(not A) = 1 - P(A). For independent events: P(A and B) = P(A)×P(B). Permutations: n!/(n-k)! for choosing k from n in order. Combinations: n!/(k!(n-k)!) for choosing k from n (order doesn't matter).","realWorldExample": "P(heads) = 1/2. Number of ways to choose 3 people from 5: C(5,3) = 10.","keyTerms":[{"term": "Probability","definition": "Number from 0 to 1 (or 0% to 100%) giving likelihood of an event."},{"term": "Permutation","definition": "Arrangement of items where order matters."},{"term": "Combination","definition": "Selection of items where order does not matter."}],"nsbTraps": ["With and without replacement change the total and favorable counts. 'At least one' = 1 - P(none)."],"didYouKnow": ["n! (n factorial) = n × (n-1) × … × 1; 0! = 1 by convention."],"relatedTopics": ["math-statistics","math-sequences"]},
  {"id": "math-statistics","subject": "Math","title": "Statistics","whatIsIt": "Statistics summarizes and analyzes data. Mean (average), median (middle), and mode (most frequent) are measures of center. Range and standard deviation measure spread.","howItWorks": "Mean = sum of values / number of values. Median: order data; middle value (or average of two middles). Mode: value that appears most. Range = max - min. Outliers can skew the mean but not the median.","realWorldExample": "Test scores: mean = class average; median = middle score; mode = most common score.","keyTerms":[{"term": "Mean","definition": "Average; sum of values divided by count."},{"term": "Median","definition": "Middle value when data are ordered; not affected much by outliers."},{"term": "Mode","definition": "Value that appears most frequently."},{"term": "Range","definition": "Difference between maximum and minimum values."}],"nsbTraps": ["Median is the middle position, not the middle value of the range. For even number of values, median is average of the two middle values."],"didYouKnow": ["Mean, median, and mode are equal in a symmetric distribution."],"relatedTopics": ["math-probability","math-functions"]},
  {"id": "math-sequences","subject": "Math","title": "Sequences & Patterns","whatIsIt": "A sequence is an ordered list of numbers following a rule. Arithmetic: add the same number each time (common difference d). Geometric: multiply by the same number (common ratio r).","howItWorks": "Arithmetic: nth term aₙ = a₁ + (n - 1)d. Sum of n terms: S = n/2 × (first + last) or S = n/2 × (2a₁ + (n-1)d). Geometric: aₙ = a₁ × rⁿ⁻¹. Finding the rule: look at differences (arithmetic) or ratios (geometric).","realWorldExample": "2, 5, 8, 11, … is arithmetic (d = 3). 2, 6, 18, 54, … is geometric (r = 3).","keyTerms":[{"term": "Arithmetic sequence","definition": "Sequence where the same number is added each time; linear pattern."},{"term": "Geometric sequence","definition": "Sequence where the same number is multiplied each time; exponential pattern."},{"term": "Common difference","definition": "In arithmetic sequence, the number added each time (d)."}],"nsbTraps": ["First term is n = 1, so aₙ = a₁ + (n-1)d, not a₁ + nd. Check the first few terms to see the pattern."],"didYouKnow": ["The Fibonacci sequence (1, 1, 2, 3, 5, 8, …) is neither arithmetic nor geometric—each term is the sum of the two before."],"relatedTopics": ["math-linear-eq","math-exponents"]},
  {"id": "math-word-problems","subject": "Math","title": "Word Problems & Unit Conversions","whatIsIt": "Word problems describe a situation in words; you translate to equations and solve. Unit conversions change from one unit to another using conversion factors (e.g., 1 ft = 12 in).","howItWorks": "Read carefully; identify what is unknown (variable). Write an equation from the words. Solve. Check. Unit conversions: multiply by fractions equal to 1 (e.g., 12 in / 1 ft) so units cancel. Dimensional analysis: keep track of units to catch errors.","realWorldExample": "If 3 pens cost $6, how much for 5 pens? (Proportion.) Convert 5 km to miles (5 × 0.621 ≈ 3.1 mi).","keyTerms":[{"term": "Conversion factor","definition": "Ratio of two equivalent quantities (e.g., 1 km = 1000 m) used to convert units."},{"term": "Dimensional analysis","definition": "Keeping track of units in calculations to ensure the answer has the right units."}],"nsbTraps": ["In conversions, set up so the unit you want stays and the one you don't want cancels. Rate problems: distance = rate × time."],"didYouKnow": ["The metric system uses powers of 10—easier for conversions (1 km = 1000 m, 1 m = 100 cm)."],"relatedTopics": ["math-ratios","math-linear-eq","math-pemdas"]},
  {"id": "ps-scientific-method","subject": "Physical Science","title": "Scientific Method & Experimentation","whatIsIt": "The scientific method is a process for answering questions: observe, ask a question, form a hypothesis, design an experiment, collect data, analyze, and draw conclusions. Experiments should be fair (control variables, one independent variable).","howItWorks": "Hypothesis is a testable prediction. Independent variable is what you change; dependent variable is what you measure. Control group is used for comparison. Constants are kept the same. Repeat trials to improve reliability.","realWorldExample": "Testing whether plants grow better with fertilizer: same light and water (constants), fertilizer vs no fertilizer (independent variable), plant height (dependent variable).","keyTerms":[{"term": "Hypothesis","definition": "Testable prediction or explanation for an observation."},{"term": "Independent variable","definition": "Variable the experimenter changes."},{"term": "Dependent variable","definition": "Variable that is measured; may depend on the independent variable."},{"term": "Control group","definition": "Group used for comparison; does not receive the treatment."}],"nsbTraps": ["Correlation does not prove causation. Only one independent variable should change per experiment."],"didYouKnow": ["Scientists publish results so others can replicate experiments and verify findings."],"relatedTopics": ["math-statistics"]},
  {"id": "math-data-graphs","subject": "Math","title": "Data & Graphs","whatIsIt": "Data can be displayed in tables, bar graphs, line graphs, pie charts, and scatter plots. Choosing the right graph depends on the type of data and what you want to show.","howItWorks": "Bar graphs: compare categories. Line graphs: show change over time. Pie charts: show parts of a whole. Scatter plots: show relationship between two variables. Always label axes and include a title.","realWorldExample": "Temperature over a week → line graph. Favorite sports → bar or pie. Height vs weight → scatter plot.","keyTerms":[{"term": "Bar graph","definition": "Graph that uses bars to compare categories."},{"term": "Line graph","definition": "Graph that shows how data change over time; points connected by lines."},{"term": "Scatter plot","definition": "Graph of points showing the relationship between two variables."}],"nsbTraps": ["Scale on axes can make differences look bigger or smaller—check the numbers."],"didYouKnow": ["Misleading graphs often use a truncated scale or wrong scale to exaggerate effects."],"relatedTopics": ["math-statistics","math-functions"]}
]
